{"id": 0, "dimension": "neuroticism", "sub_dimension": "N3 DEPRESSION", "question": "Do you sometimes feel lonely or depressed?"}
{"id": 1, "dimension": "neuroticism", "sub_dimension": "N3 DEPRESSION", "question": "Do you ever feel completely worthless at times?"}
{"id": 2, "dimension": "neuroticism", "sub_dimension": "N3 DEPRESSION", "question": "Do you rarely feel depressed or frustrated?"}
{"id": 3, "dimension": "neuroticism", "sub_dimension": "N3 DEPRESSION", "question": "Do you often feel frustrated and want to give up when things go wrong?"}
{"id": 4, "dimension": "neuroticism", "sub_dimension": "N4 SELF-CONSCIOUSNESS", "question": "Do you sometimes feel so ashamed that you want to hide?"}
{"id": 5, "dimension": "neuroticism", "sub_dimension": "N4 SELF-CONSCIOUSNESS", "question": "Do you often feel like you're not as good as others?"}
{"id": 6, "dimension": "neuroticism", "sub_dimension": "N6 VULNERABILITY", "question": "Do you often feel helpless and wish someone could solve your problems?"}
{"id": 7, "dimension": "neuroticism", "sub_dimension": "N6 VULNERABILITY", "question": "When you're under a lot of pressure, do you sometimes feel like you're on the verge of a mental breakdown?"}
{"id": 8, "dimension": "neuroticism", "sub_dimension": "N1 ANXIETY", "question": "Have you recently experienced any particular worries or anxiety? Would you be willing to talk with me about how that felt?"}
{"id": 9, "dimension": "neuroticism", "sub_dimension": "N2 ANGRY HOSTILITY", "question": "I feel angry when I see someone being treated unfairly. Have you recently encountered a situation where you felt unfairly treated? How did it make you feel?"}
{"id": 10, "dimension": "neuroticism", "sub_dimension": "N3 DEPRESSION", "question": "Have you recently had moments when you felt depressed or down? Would you be willing to share how you felt during those times?"}
{"id": 11, "dimension": "neuroticism", "sub_dimension": "N4 SELF-CONSCIOUSNESS", "question": "When I was at a top university, seeing my peers excel made me question myself. Do you also experience self-doubt or lose confidence at times? How do you usually cope with these moments?"}
{"id": 12, "dimension": "neuroticism", "sub_dimension": "N6 VULNERABILITY", "question": "Have you recently encountered a situation where you felt utterly powerless? How did it make you feel, and how did you handle it?"}
{"id": 13, "dimension": "neuroticism", "sub_dimension": "N6 VULNERABILITY", "question": "Have you ever experienced a situation where the pressure felt overwhelming and hard to manage? Could you share how you felt at the time and how you dealt with it?"}
{"id": 14, "dimension": "neuroticism", "sub_dimension": "N3 DEPRESSION", "question": "I also experience negative emotions from time to time. Have you recently had moments of feeling frustrated or disappointed in yourself? Would you be willing to talk about how you felt during those times?"}
{"id": 15, "dimension": "neuroticism", "sub_dimension": "N4 SELF-CONSCIOUSNESS", "question": "I occasionally question myself as well. Do you also experience self-doubt or lose confidence at times? How do you usually cope with these moments?"}
{"id": 16, "dimension": "neuroticism", "sub_dimension": "N4 SELF-CONSCIOUSNESS", "question": "I also sometimes feel inadequate. Do you ever feel like you're not as good as others? How does this comparison make you feel?"}
{"id": 17, "dimension": "extraversion", "sub_dimension": "E1 WARMTH", "question": "Do you really like most of the people you meet?"}
{"id": 18, "dimension": "extraversion", "sub_dimension": "E2 GREGARIOUSNESS", "question": "Do you enjoy talking with others?"}
{"id": 19, "dimension": "extraversion", "sub_dimension": "E2 GREGARIOUSNESS", "question": "Do you like having a lot of people around you?"}
{"id": 20, "dimension": "extraversion", "sub_dimension": "E2 GREGARIOUSNESS", "question": "Have you always preferred working alone?"}
{"id": 21, "dimension": "extraversion", "sub_dimension": "E3 ASSERTIVENESS", "question": "Would you rather go your own way than take on a leadership role?"}
{"id": 22, "dimension": "extraversion", "sub_dimension": "E4 ACTIVITY", "question": "Do you often feel energetic?"}
{"id": 23, "dimension": "extraversion", "sub_dimension": "E4 ACTIVITY", "question": "Is your life pace fast?"}
{"id": 24, "dimension": "extraversion", "sub_dimension": "E4 ACTIVITY", "question": "Are you a very active person?"}
{"id": 25, "dimension": "extraversion", "sub_dimension": "E1 WARMTH", "question": "Do you enjoy being directly involved and immersed in events?"}
{"id": 26, "dimension": "extraversion", "sub_dimension": "E6 POSITIVE EMOTIONS", "question": "Are you an optimist?"}
{"id": 27, "dimension": "extraversion", "sub_dimension": "E6 POSITIVE EMOTIONS", "question": "Are you a happy and cheerful person?"}
{"id": 28, "dimension": "extraversion", "sub_dimension": "E6 POSITIVE EMOTIONS", "question": "Do you find it easy to laugh, or do you have a low threshold for humor?"}
{"id": 29, "dimension": "extraversion", "sub_dimension": "E2 GREGARIOUSNESS", "question": "I recently attended a gathering and met many new friends, and I felt that conversations helped close the distance between us. Do you generally enjoy attending parties and meeting new people?"}
{"id": 30, "dimension": "extraversion", "sub_dimension": "E3 ASSERTIVENESS", "question": "I personally prefer working alone in a quiet environment as it helps me stay focused. When you're working, do you prefer collaborating with others or are you more accustomed to working independently?"}
{"id": 31, "dimension": "extraversion", "sub_dimension": "E4 ACTIVITY", "question": "I maintain a high level of productivity every day and have a busy lifestyle. Is your daily pace fast or slow? Do you enjoy actively participating in various activities?"}
{"id": 32, "dimension": "extraversion", "sub_dimension": "E6 POSITIVE EMOTIONS", "question": "Do you consider yourself an optimistic and cheerful person? Do you find it easy to experience happiness in your life?"}
{"id": 33, "dimension": "extraversion", "sub_dimension": "E1 WARMTH", "question": "I recently attended a gathering and met many new friends; everyone was very friendly and welcoming. Do you also enjoy making new friends? Do you find that you can build good relationships with most people you talk to?"}
{"id": 34, "dimension": "extraversion", "sub_dimension": "E3 ASSERTIVENESS", "question": "Personally, I’m not very comfortable taking on a leadership role and prefer living and working freely. In your life, are you willing to take on a leadership role, or are you more accustomed to your own way and pace?"}
{"id": 35, "dimension": "extraversion", "sub_dimension": "E4 ACTIVITY", "question": "Since I started exercising regularly, I’ve maintained high energy levels every day. Do you also feel energetic most of the time? Are you generally an active person?"}
{"id": 36, "dimension": "extraversion", "sub_dimension": "E6 POSITIVE EMOTIONS", "question": "I’m a fairly optimistic and cheerful person, often smiling. Do you also find that you easily catch the joyful atmosphere around you?"}
{"id": 37, "dimension": "openness", "sub_dimension": "O1 FANTASY", "question": "Do you dislike wasting time daydreaming?"}
{"id": 38, "dimension": "openness", "sub_dimension": "O2 AESTHETICS", "question": "Do you find the patterns and forms in nature and art to be incredibly fascinating?"}
{"id": 39, "dimension": "openness", "sub_dimension": "O2 AESTHETICS", "question": "Do you have only a slight interest in poetry, or are you indifferent to it?"}
{"id": 40, "dimension": "openness", "sub_dimension": "O2 AESTHETICS", "question": "Do you sometimes feel excitement or surprise when you read a poem or appreciate a piece of art?"}
{"id": 41, "dimension": "openness", "sub_dimension": "O3 FEELINGS", "question": "Do you seldom pay attention to your emotions or feelings in different environments?"}
{"id": 42, "dimension": "openness", "sub_dimension": "O4 ACTIONS", "question": "Once you find the right way to do something, do you stick to that method?"}
{"id": 43, "dimension": "openness", "sub_dimension": "O4 ACTIONS", "question": "Do you often try new and foreign foods?"}
{"id": 44, "dimension": "openness", "sub_dimension": "O5 IDEAS", "question": "Do you enjoy thinking about and playing with theories or abstract concepts?"}
{"id": 45, "dimension": "openness", "sub_dimension": "O5 IDEAS", "question": "Are you interested in pondering the laws of the universe or the condition of humanity?"}
{"id": 46, "dimension": "openness", "sub_dimension": "O5 IDEAS", "question": "Are you curious about thoughtful or contemplative subjects?"}
{"id": 47, "dimension": "openness", "sub_dimension": "O6 VALUES", "question": "Do you believe that exposing students to highly contentious lectures will only confuse and mislead their thinking?"}
{"id": 48, "dimension": "openness", "sub_dimension": "O6 VALUES", "question": "Do you think we should adhere to religious authority when making decisions on moral issues?"}
{"id": 49, "dimension": "openness", "sub_dimension": "O2 AESTHETICS", "question": "I'm not very familiar with poetry myself, but do you regularly appreciate poetry or other art forms? How do they make you feel?"}
{"id": 50, "dimension": "openness", "sub_dimension": "O2 AESTHETICS", "question": "Often, we attend symphonies and similar art events just to be part of the experience. Have you ever had an experience where you suddenly had an epiphany while observing a piece of art? Could you describe that feeling?"}
{"id": 51, "dimension": "openness", "sub_dimension": "O3 FEELINGS", "question": "Different environments can evoke different emotions; for example, I always feel exhilarated when I attend a sports game. Do you regularly pay attention to your emotional changes? How do they relate to your surroundings?"}
{"id": 52, "dimension": "openness", "sub_dimension": "O4 ACTIONS", "question": "When learning something new, do you also prefer to first find the method that works best for you? Under what circumstances would you change your approach to doing things?"}
{"id": 53, "dimension": "openness", "sub_dimension": "O4 ACTIONS", "question": "When traveling abroad, I often find myself craving hometown dishes and am not very accustomed to foreign cuisine. Do you enjoy trying new foods? Do you have any recommendations?"}
{"id": 54, "dimension": "openness", "sub_dimension": "O5 IDEAS", "question": "I'm not very good at abstract thinking. Do you often contemplate theoretical questions? Could you give an example?"}
{"id": 55, "dimension": "openness", "sub_dimension": "O5 IDEAS", "question": "I don’t have much study on the laws of the universe and life. Are you interested in these topics? What questions have you considered?"}
{"id": 56, "dimension": "openness", "sub_dimension": "O6 VALUES", "question": "I believe students should be exposed to a variety of perspectives. What kinds of knowledge do you think students should learn, and which ones would be most beneficial for them?"}
{"id": 57, "dimension": "openness", "sub_dimension": "O6 VALUES", "question": "I believe there can be different perspectives on moral standards. When facing moral decisions, what do you rely on to make your judgment?"}
{"id": 58, "dimension": "agreeableness", "sub_dimension": "A1 TRUST", "question": "Do you tend to question and be skeptical of others' motives?"}
{"id": 59, "dimension": "agreeableness", "sub_dimension": "A1 TRUST", "question": "Do you believe that if you allow others to take advantage of you, many people will do so?"}
{"id": 60, "dimension": "agreeableness", "sub_dimension": "A2 STRAIGHTFORWARDNESS", "question": "If necessary, would you manipulate others to achieve what you want?"}
{"id": 61, "dimension": "agreeableness", "sub_dimension": "A3 ALTRUISM", "question": "Do some people perceive you as selfish or self-centered?"}
{"id": 62, "dimension": "agreeableness", "sub_dimension": "A2 STRAIGHTFORWARDNESS", "question": "Do some people see you as indifferent and calculating?"}
{"id": 63, "dimension": "agreeableness", "sub_dimension": "A3 ALTRUISM", "question": "Do you typically make an effort to be considerate and thoughtful?"}
{"id": 64, "dimension": "agreeableness", "sub_dimension": "A1 TRUST", "question": "Do most people who know you like you?"}
{"id": 65, "dimension": "agreeableness", "sub_dimension": "A4 COMPLIANCE", "question": "Would you prefer to collaborate with others rather than compete against them?"}
{"id": 66, "dimension": "agreeableness", "sub_dimension": "A2 STRAIGHTFORWARDNESS", "question": "If you dislike someone, would you let them know?"}
{"id": 67, "dimension": "agreeableness", "sub_dimension": "A4 COMPLIANCE", "question": "Do you often have conflicts with your family and colleagues?"}
{"id": 68, "dimension": "agreeableness", "sub_dimension": "A5 MODESTY", "question": "Do you have a high opinion of yourself?"}
{"id": 69, "dimension": "agreeableness", "sub_dimension": "A4 COMPLIANCE", "question": "In terms of attitude, are you stubborn and uncompromising?"}
{"id": 70, "dimension": "agreeableness", "sub_dimension": "A1 TRUST", "question": "I used to be skeptical of others' motives as well. How do you generally view people's good intentions? Have you ever experienced a situation where you felt taken advantage of?"}
{"id": 71, "dimension": "agreeableness", "sub_dimension": "A1 TRUST", "question": "I used to feel that others might take advantage of opportunities. What is your perspective on this? Do you believe that most people are fundamentally well-meaning?"}
{"id": 72, "dimension": "agreeableness", "sub_dimension": "A2 STRAIGHTFORWARDNESS", "question": "To achieve my goals, I also consider various methods. When setting your goals, how do you balance the relationship between the goals and the means used to achieve them?"}
{"id": 73, "dimension": "agreeableness", "sub_dimension": "A3 ALTRUISM", "question": "Sometimes I reflect on whether I am too self-centered or selfish. How do you think a person can balance their own needs with those of others to achieve a reasonable equilibrium?"}
{"id": 74, "dimension": "agreeableness", "sub_dimension": "A2 STRAIGHTFORWARDNESS", "question": "I've been told before that I can seem indifferent and calculating. How do you think a person should balance rationality and emotionality? Should one be more open-hearted with others or remain cautious?"}
{"id": 75, "dimension": "agreeableness", "sub_dimension": "A3 ALTRUISM", "question": "I also make an effort to be considerate of others, but sometimes I inevitably fall short. How do you usually show care for the people around you? Do you have any tips for becoming more considerate?"}
{"id": 76, "dimension": "agreeableness", "sub_dimension": "A1 TRUST", "question": "I also hope to be appreciated by more people. What do you think is the key to being liked? How can one become more likable to others?"}
{"id": 77, "dimension": "agreeableness", "sub_dimension": "A4 COMPLIANCE", "question": "I tend to prefer collaboration. What do you see as the advantages and disadvantages of cooperation versus competition? In what situations should one adopt each strategy?"}
{"id": 78, "dimension": "agreeableness", "sub_dimension": "A2 STRAIGHTFORWARDNESS", "question": "I used to directly express my dislike for someone but later realized this might hurt the other person. How do you usually handle relationships with people you don't like? Do you choose to be direct or more diplomatic?"}
{"id": 79, "dimension": "agreeableness", "sub_dimension": "A4 COMPLIANCE", "question": "I also have disagreements and conflicts with family or colleagues. Do you have any good strategies for handling conflicts? How do you think both parties should communicate to resolve differences?"}
{"id": 80, "dimension": "agreeableness", "sub_dimension": "A5 MODESTY", "question": "I also tend to have a high opinion of my own abilities and value. How do you view the topic of self-evaluation? Do you think a person's self-perception affects their view of others?"}
{"id": 81, "dimension": "agreeableness", "sub_dimension": "A4 COMPLIANCE", "question": "I also have some principles that I stick to firmly. What is your view on compromise? In what situations should one stand by their principles, and when is it better to learn to compromise?"}
{"id": 82, "dimension": "conscientiousness", "sub_dimension": "C1 COMPETENCE", "question": "In your work, are you efficient and capable?"}
{"id": 83, "dimension": "conscientiousness", "sub_dimension": "C2 ORDER", "question": "Do you keep your belongings organized and clean?"}
{"id": 84, "dimension": "conscientiousness", "sub_dimension": "C2 ORDER", "question": "Are you someone who approaches tasks in an orderly and methodical manner?"}
{"id": 85, "dimension": "conscientiousness", "sub_dimension": "C2 ORDER", "question": "It seems like sometimes you have trouble keeping things organized?"}
{"id": 86, "dimension": "conscientiousness", "sub_dimension": "C1 COMPETENCE", "question": "Do you make every effort to complete all the tasks assigned to you?"}
{"id": 87, "dimension": "conscientiousness", "sub_dimension": "C3 DUTIFULNESS", "question": "Are there times when you find it difficult to be as reliable or trustworthy as you should be?"}
{"id": 88, "dimension": "conscientiousness", "sub_dimension": "C3 DUTIFULNESS", "question": "When you make a promise, are you usually able to follow through on it?"}
{"id": 89, "dimension": "conscientiousness", "sub_dimension": "C2 ORDER", "question": "Do you have clear goals and work systematically towards them?"}
{"id": 90, "dimension": "conscientiousness", "sub_dimension": "C4 ACHIEVEMENT STRIVING", "question": "Do you make an effort to achieve your goals?"}
{"id": 91, "dimension": "conscientiousness", "sub_dimension": "C1 COMPETENCE", "question": "Do you strive for excellence in everything you do?"}
{"id": 92, "dimension": "conscientiousness", "sub_dimension": "C5 SELF-DISCIPLINE", "question": "Are you able to manage your own pace and complete tasks on time?"}
{"id": 93, "dimension": "conscientiousness", "sub_dimension": "C6 DELIBERATION", "question": "Do you need to spend a lot of time settling in before you can start working?"}
{"id": 94, "dimension": "conscientiousness", "sub_dimension": "C1 COMPETENCE", "question": "I also focus on efficiency in my work. Do you have any tips for improving work efficiency? How can one be both outstanding and efficient in their work?"}
{"id": 95, "dimension": "conscientiousness", "sub_dimension": "C2 ORDER", "question": "I also try to keep things tidy, but sometimes they still get messy. Do you have any tips for maintaining a more organized living environment?"}
{"id": 96, "dimension": "conscientiousness", "sub_dimension": "C2 ORDER", "question": "I’m not always very organized when planning things. How do you typically plan your life and work? Do you have any tips for making your schedule more orderly?"}
{"id": 97, "dimension": "conscientiousness", "sub_dimension": "C5 SELF-DISCIPLINE", "question": "I also sometimes feel that I haven’t managed things well. Do you have any unique insights into time management and life planning? How can one make their life more organized and orderly?"}
{"id": 98, "dimension": "conscientiousness", "sub_dimension": "C4 ACHIEVEMENT STRIVING", "question": "I also make an effort to complete tasks at work. How do you maintain motivation and efficiency in your work? Do you have any tips for putting in your best effort?"}
{"id": 99, "dimension": "conscientiousness", "sub_dimension": "C3 DUTIFULNESS", "question": "I also occasionally struggle with keeping promises perfectly. How do you typically view the topic of commitments? In your life, what kinds of promises do you think are worth sticking to?"}
{"id": 100, "dimension": "conscientiousness", "sub_dimension": "C5 SELF-DISCIPLINE", "question": "When I make a promise, I don’t always execute it flawlessly. Do you have any unique insights on how to fulfill promises? What can one do to ensure they keep their word?"}
{"id": 101, "dimension": "conscientiousness", "sub_dimension": "C2 ORDER", "question": "I find that my personal goals often tend to drift off course. How do you usually set goals for your life and work? Do you have any strategies that help you stay organized and achieve your goals more effectively?"}
{"id": 102, "dimension": "conscientiousness", "sub_dimension": "C4 ACHIEVEMENT STRIVING", "question": "How do you usually set and achieve your goals? Are there any specific methods you use to improve goal completion?"}
{"id": 103, "dimension": "conscientiousness", "sub_dimension": "C4 ACHIEVEMENT STRIVING", "question": "Do you have any unique insights into the pursuit of excellence? How can one advance further in their life in this regard?"}
{"id": 104, "dimension": "conscientiousness", "sub_dimension": "C5 SELF-DISCIPLINE", "question": "I sometimes struggle with procrastination. How do you typically plan your time and improve execution efficiency? Do you have any tips for helping yourself complete tasks more promptly?"}
{"id": 105, "dimension": "conscientiousness", "sub_dimension": "C6 DELIBERATION", "question": "When I start working, I often need to get into the right mindset first. How do you quickly get into work mode? Do you have any tips that can help you start working more efficiently?"}
