{
    "Antonio Salieri": "Antonio Salieri had always dreamed of becoming a music composer like his idol Mozart, but his father scoffed at his dream and wanted him to pursue business instead. Salieri had a deep devotion to God and prayed to him that he would give him the opportunity to compose music and he would honor him in return by using this gift to bring him honor and glory. He then saw it as divine intervention when his father choked to death, because it meant he could follow his dream.\n\nYears later, in 1791, Salieri is part of the cultural elite in Vienna and has been appointed court composer for Holy Roman Emperor Joseph II. Although Salieri admittedly felt the emperor had \"no ear at all\" in music, it did not matter to him because he was well respected and loved by others for his work. He wrote 40 operas alone and honored God in return by keeping his hands off women and teaching students (many for free) in music.\n\nSeven years later, at a reception in honor of Mozart's patron, the Prince-Archbishop of Salzburg, Salieri anxiously awaits meeting his idol. Guessing his identity, he is shocked to discover that the transcendentally talented Mozart is obscene, silly, and immature. Later, when Mozart meets the Emperor, Salieri presents Mozart with a \"March of Welcome\" he had created. After hearing the march only once, Mozart plays it from memory, critiques it, and effortlessly improvises a variation. Salieri is thus humiliated in front of his peers and expresses anger towards God for the first time in his life.\n\nSalieri's dislike for Mozart turns to hatred once the later has an affair with one of Salieri's pupils, Katerina Cavalieri, whom he was deeply attracted to. Salieri begins to lose his own sanity and begs God to send Mozart away for both their sakes. His jealousy increases when the Emperor considers Mozart for tutoring his niece in music, rather than Salieri himself.\n\nConstanze met with him to discuss giving Mozart the royal position and showed him one of his works without Mozart knowing. Salieri was both impressed and angered by how \"miraculous\" it was, especially given it was not a copy. He blackmailed Constanze into coming back the following night to have sex with him in exchange for giving the position to Mozart. Despite Salieri praying for God to give him the touch of true music, Constanze did indeed show up and took off her shirt, but he had one of his servants show her out, humiliating her. He then renounced God for giving Mozart transcendent talent while ignoring him, and swore revenge on both Mozart and God.\n\nAfter Mozart's father died, Salieri planned to kill Mozart and take credit for his work. He disguised himself as a stranger in a masked costume similar to one he saw his father wear at the party, and asked Mozart to write a Requiem, giving him a downpayment and promising him a large sum upon completion. His plan was to use the Requiem during Mozart's funeral after he had killed him and pass it off as his own work. Salieri hired a servant girl to spy on Mozart's work, one of which (The Marriage of Figaro) he knew would be disapproved by the Emperor and exposed it to him.\n\nDue to the pressure brought on by Salieri and his father's death, Mozart started drinking heavily, causing his health and relationship with Constanze to deteriorate. Mozart later collapsed during a performance of \"The Magic Flute,\" and Salieri brought him home. When the actors for Mozart's play show up at the door to check on him, Mozart thinks it's the man whom Salieri disguises himself as, and sends him down to talk to him. Salieri manages to brush the actors off, and takes Mozart's share of money they give him. Once they leave he tells Mozart the money was from the man and that he wants him to have the Requiem done by the next night. Salieri offers to write it down while Mozart describes it to him. They spend the whole night together working on it. When Constanze returns in the morning, she tells Salieri to leave, but he refuses. She locks the manuscript away before they can finish it and once again tells Salieri to leave. He tells her he will not do so unless Mozart tells him to leave himself. She tries to get Mozart to do so, only to discover that he has died-thus Salieri's plan to take credit for the Requiem is ruined.\n\n32 years later, Salieri grows tired of watching his music become less popular and Mozart's becoming more famous. He later blames himself for Mozart's death due to having put him in poverty, begs him for forgiveness in prayer and confesses to having killed him loudly enough for others to hear. He tries kill himself by slitting his throat, but is saved by his servants. He's taken to an insane asylum, where he confesses to a young priest and tells him of his life story. Salieri concludes that God killed Mozart and kept him alive to torture, not allowing him to share in even the smallest part of Mozart's glory. He then absolves the priest of his own mediocrity, considering himself the \"champion\" and \"patron saint\" for all mediocrities. As he's being taken away in his wheelchair, he absolves all the other patients of their mediocrity-while remembering Mozart's infamous laugh.\n",
    "Wolfgang Amadeus Mozart": "Mozart was a child prodigy composer in Vienna, attracting much attention with his astounding musical talent. During an audience with the Emperor, Mozart demonstrated his exceptional skill by playing Salieri's \"March of Welcome\" from memory and improvising modifications on the spot.\n\nMozart's alcoholism ruins his health, marriage, finances, and reputation at court, even as he continues to produce brilliant work. Salieri hires a young girl to work as Mozart's maid and thereby discovers that Mozart is working on an opera based on the play The Marriage of Figaro, which the Emperor has forbidden, owing to its subversive theme. When Mozart is summoned to court to explain, he manages to convince the Emperor to allow his opera to premiere, despite Salieri's attempts at sabotage. When Mozart is informed that his father has died, he writes Don Giovanni in his grief. Mozart's friend Emanuel Schikaneder invites him to write an opera for his theatre. Mozart obliges, despite his wife Constanze's insistence that he finish the Requiem, as the opera is a riskier venture. After arguing with Mozart, Constanze leaves with their young son, Karl.\n\nThe opera in question, The Magic Flute, is a great success, but the overworked Mozart collapses during one performance. Salieri takes him home and persuades him to continue writing the Requiem, offering to take the bedridden Mozart's dictation; the two lay down the opening of the Confutatis together. The next morning, Mozart thanks Salieri for his friendship and Salieri admits that Mozart is the greatest composer he knows. Although they worked together to complete part of the piece, Mozart died before Constanze returned, leaving the Requiem unfinished.\n\nAfter Mozart's death, his musical reputation gradually rose, while Salieri's music faded into obscurity.\n"
}