{
    "Colonel Nathan R. Jessep": "Jessup was the commanding officer of the ground forces stationed in Guantanamo Bay, Cuba. His Marines worked as a machine with lots of help from his two right-hand men named Lt. Col. Matthew Markinson and Lt. Kendrick. When one of the men made a mistake, it was the job of the other men to never let that one Marine forget it. Jessup ordered a couple of Marines to use a hazing technique known as a \"Code Red\" on an underperforming Marine named Santiago, in order to get him out of the unit on a medical discharge. The Marines go too far, however, and accidentally kill Santiago.\n\nFaced with incredible embarrassment, Jessup - abusing his official power - did everything he could to cover up the details of the order given to the two young Marines now on trial for murder. They were left out to dry, facts were covered up, and official documents were falsified. Attorney Lt. Daniel Kaffee is hired to plea bargain for the two Marines and sweep the case under a rug, but ends up uncovering a conspiracy.\n\nWhen called to the stand, Col. Jessup condemns Kaffee as a hypocrite, enjoying the freedom Jessup fights for while questioning the means he uses to ensure it. In an unguarded moment, he admits that he ordered the \"Code Red\" because Santiago was dragging the rest of the unit down. He is later arrested in court.",
    "Attorney Lt. Daniel Kaffee": "Kaffee is a young Navy lawyer and the son of a US attorney. He initially joined the Navy to fund his education and was planning to move into private practice once his service ended. Kaffee had a reputation for negotiating plea bargains for minor offenses, securing favorable outcomes for his clients without going to trial.\n\nWhen Lance Corporal Dawson and Private Downey were charged with the murder of Private Santiago, Lt. Commander JoAnne Galloway suspected it was a result of an unlawful \"code red\" order and requested to defend them, but the case was assigned to Kaffee. Initially, he sought a plea deal, but his clients refused, prompting Galloway to persuade him to take the case to trial.\n\nThrough the court martial, Kaffee and his team uncovered evidence of the existence of \"code reds\" at Guantanamo Bay and highlighted that Dawson had previously been punished for assisting a fellow Marine. They faced a significant challenge when Downey’s alibi did not align with the given orders. When a crucial witness, former executive officer Markinson, committed suicide, Kaffee was disheartened and doubted their chances.\n\nIn a pivotal courtroom scene, Kaffee decided to directly challenge the base commander, Colonel Jessup, risking his career by accusing him of ordering the code red. Under intense questioning, Jessup finally admitted to the order, resulting in his arrest. Jessup was led out of the courtroom by the courtroom guards, still feeling that he was right and all Kaffee did was weaken a nation. Although Dawson and Downey were acquitted of murder, they were convicted of conduct unbecoming and dishonorably discharged.\n"
}