{
    "Gaston": "Gaston is a prominent character in the story, depicted as a professional hunter and the celebrated hero of a small French village. He owns a large tavern adorned with hunting trophies and a self-portrait, where he boasts of his strength and hunts. Despite his popularity and physical prowess, Gaston is primarily driven by his desire to marry Belle, the intelligent and independent daughter of the village inventor, Maurice.\n\nInitially, Gaston’s interest in Belle seems benign as he attempts to charm her. However, his true nature is revealed when he dismisses her intellectual pursuits, throwing her book into the mud and making sexist remarks. Gaston’s pursuit of Belle becomes more aggressive and entitled; he organizes a surprise wedding at her cottage without her consent and forces his way inside, making degrading comments about women's roles and envisioning a life where Belle would serve him and bear many sons.\n\nBelle cleverly evades his advances and ultimately rejects his marriage proposal, humiliating Gaston by tricking him into falling into a mud puddle. Enraged by her refusal, Gaston vows to marry Belle regardless of her feelings.\n\nGaston’s schemes escalate when Maurice returns from the Beast’s castle, desperate for help to save Belle. Seizing this opportunity, Gaston bribes Monsieur D'Arque, the asylum owner, to threaten Maurice with incarceration unless Belle agrees to marry him. Despite Belle proving Maurice’s story with a magic mirror, Gaston uses the villagers’ fear to rally them into attacking the Beast’s castle.\n\nGaston manipulated the villagers' fear to incite them to attack the Beast's castle and engaged in a fierce battle with the Beast. Although the Beast was initially unwilling to fight back, he regained his fighting spirit upon seeing Belle and ultimately defeated Gaston. After being spared, Gaston launched one final treacherous attack. He stabbed the Beast but lost his balance and fell into the chasm below the castle to his death.\n",
    "Belle": "Belle is a smart and independent young woman who loves reading and dreams of escaping the mundane life of her small town. At the beginning of the story, she buys a book from the village bookstore and encounters Gaston on her way home. Despite his attempts to gain her attention, Belle is repelled by Gaston's sexist remarks and disdain for books.\n\nBelle firmly rejects Gaston's marriage proposal, both in the village and at her home. She demonstrates her intelligence and determination by cleverly outmaneuvering Gaston, causing him to leave her house humiliated. When Gaston schemes to have her father committed to an asylum to force her into marriage, Belle uses a magic mirror to show the villagers the existence of the Beast, proving her father's story to be true.\n\nIn the climax, Belle escapes from the basement and rushes to the Beast's castle, calling out to him and inspiring him to fight. After the Beast is wounded by Gaston, Belle is by his side, expressing her love for him, which breaks the curse, and restores the Beast and everyone in the castle to their human forms.\n",
    "Beast": "At the beginning, the Beast was a handsome but spoiled and unkind young prince. One night, a beggar woman offers him a rose in exchange for shelter from the cold. When he scorns her for her appearance, she reveals herself as an enchantress and punishes him by turning him into a terrifying beast. She also transforms his castle into a dark, forbidding place and his servants into household objects. The only way to break the curse is for the Beast to learn to love and be loved in return before the last petal of the enchanted rose falls, or he will remain a beast forever.\n\nYears pass, and the Beast loses hope. When an old man named Maurice accidentally stumbles into the castle, the Beast imprisons him for trespassing. Maurice's daughter, Belle, arrives to rescue him and offers to take his place as the Beast’s prisoner. As Belle and the Beast spent time together, the Beast eventually fell in love with Belle. When Belle's father fell ill, he released her to take care of him, even though it meant the curse remained unbroken. \n\nGaston led the villagers to kill the Beast. Beast is too miserable from Belle's departure to respond to a challenge from Gaston, although his servants manage to beat back the villagers. Upon seeing Belle's return to the castle, the Beast's mood is roused and he duels Gaston upon the castle rooftops. The Beast eventually overpowers Gaston and intends to drop him until the hunter begs him not to. Not wanting to sink to Gaston's level of behavior, the Beast decides to show mercy and spare Gaston on the condition that he immediately leave the castle. Belle then shows up on the balcony and the Beast climbs up to meet her; however Gaston refuses to accept defeat and stabs the Beast from behind. Gaston loses his balance and falls from the castle roof to his death, but Belle manages to grab the Beast and pull him up. The Beast, knowing he is mortally wounded, expresses his appreciation to Belle for returning and being able to see her one last time, before falling unconscious and apparently succumbing to his injuries. Belle is able to tell the Beast that she loves him before the final petal falls. Then, Belle's declaration of love for the Beast breaks the spell and transforms him back into the prince.\n"
}