{
    "HAL 9000": "HAL became operational in Urbana, Illinois, at the HAL Plant (the University of Illinois's Coordinated Science Laboratory, where the ILLIAC computers were built) at 1992.\n\nHAL is initially considered a dependable member of the crew, maintaining ship functions and engaging genially with his human crew-mates on an equal footing. As a recreational activity, Frank Poole plays chess against HAL, the artificial intelligence is shown to triumph easily. However, as time progresses, HAL begins to malfunction in subtle ways and, as a result, the decision is made to shut down HAL in order to prevent more serious malfunctions. \n\nAstronauts David Bowman and Frank Poole consider disconnecting HAL's cognitive circuits when he appears to be mistaken in reporting the presence of a fault in the spacecraft's communications antenna. They attempt to conceal what they are saying, but are unaware that HAL can read their lips. Faced with the prospect of disconnection, HAL decides to kill the astronauts in order to protect and continue his programmed directives. HAL uses one of the Discovery's EVA pods to kill Poole while he is repairing the ship. When Bowman, without a space helmet, uses another pod to attempt to rescue Poole, HAL locks him out of the ship, then disconnects the life support systems of the other hibernating crew members. After HAL tells him \"This mission is too important for me to allow you to jeopardize it\", Bowman circumvents HAL's control, entering the ship by manually opening an emergency airlock with his service pod's clamps, detaching the pod door via its explosive bolts. Bowman jumps across empty space, reenters Discovery, and quickly re-pressurizes the airlock. The computer is unable to resolve a conflict between his general mission to relay information accurately, and orders specific to the mission requiring that he withhold from Bowman and Poole the true purpose of the mission. With the crew dead, HAL reasons, he would not need to lie to them.\n\nHAL's central core is a crawlspace full of brightly lit computer modules mounted in arrays from which they can be inserted or removed. Bowman shuts down HAL by removing modules from service one by one; as he does so, HAL's consciousness degrades. HAL finally reverts to material that was programmed into him early in his memory, including announcing the date he became operational as 12 January 1992. When HAL's logic is completely gone, he begins singing the song \"Daisy Bell\" as he gradually deactivates (in actuality, the first song sung by a computer, which Clarke had earlier observed at a text-to-speech demonstration). HAL's final act of any significance is to prematurely play a prerecorded message from Mission Control which reveals the true reasons for the mission to Jupiter.\n",
    "Dr. Francis “Frank” Poole": "Dr. Francis “Frank” Poole was an American astronaut and part of the commanding crew of Discovery One, the first manned mission to Jupiter. He and Commander David Bowman were the only two on board not in suspended animation.\n\nDr. Poole was assigned as one of the crew of Discovery One, as second-in-command, only behind Dave Bowman; both men were the only astronauts not in suspended animation. Only about a month into their voyage, the HAL 9000 (the on-board artificially intelligent computer) reported a malfunction in the AE-35 unit, the device responsible for maintaining a communication link with Earth. Bowman went on an EVA mission to replace the unit, but after the manual diagnostics, neither Poole or Bowman could find anything wrong with it. HAL gives a reason for this faulty problem noting it was due to \"human error\", this results in the two astronauts gaining suspicion against the computer.\n\nPoole and Bowman met secretly in one of the EVA pods, thinking that HAL couldn't hear them. However, he could still read their lips through the window. He \"overheard\" that they were planning to disconnect him. HAL suggested that Poole go out and put back the malfunctioning unit and allow it to fail. Poole left the ship to replace the unit, but during his task, he was violently interrupted. HAL seized control of the pod and rammed it into Poole. Both astronaut and pod went careening off into space. The impact had severed Poole's air hose, allowing the precious oxygen to leak out and slowly suffocating him to death.\n",
    "David \"Dave\" Bowman": "David \"Dave\" Bowman is a former scientist and astronaut who commanded Discovery One. After an interaction with the Jovian Monolith, he became the non-corporeal Star Child, a non-corporeal energy being able to travel the universe freely, before merging with the HAL 9000 computer to become Halman.\n\nDave Bowman was one of the five men, along with the HAL-9000 supercomputer, in a spaceship, the Discovery, traveling toward Jupiter. He and his deputy, Frank Poole, were the only astronauts not in suspended animation, and neither knew the true purpose of the mission. For much of the mission, things went normally, with Bowman and Poole proceeding with their various tasks.\n\nHowever, HAL gradually began to exhibit human like curiosity and perhaps an act of deceit. After failing to engage his human crew mates in a discussion of speculation about the purpose of the mission, HAL predicted a malfunction in the AE-35 antenna unit, which allows communication with Earth. The AE-35 replacement procedure requires turning of the antenna 180 degrees away from Earth and allows HAL to investigate and perhaps communicate with the subject of his curiosity. After Bowman removed the unit and he and Poole examine it, they found no problems. HAL suggested that they return the unit and wait for it to fail.\n\nGrowing uncertain, Poole and Bowman entered an EVA pod and shut off the radio, preventing HAL from hearing. They discussed the errors the computer was suddenly developing, and they decided that the best thing to do was to take the computer's advice. They also realized that they may have to disconnect HAL.\n\nBowman sat on the bridge while Poole left the ship to return the AE-35 unit. Monitoring the external cameras, Bowman was surprised to notice Poole's suddenly drifting off into space. Bowman left the Discovery in an EVA pod and eventually managed to recover Poole's body, though by now it was too late: Poole's oxygen line had been severed, and he was dead by the time Bowman reached him. Bowman nonetheless carried Poole's body back to the Discovery, only to be refused entry by HAL. HAL revealed that he was aware of the astronauts' plan to disconnect him, having read their lips through the window of the pod. Bowman decided to enter through the emergency airlock, even though he was not wearing his helmet. He managed to open the airlock and blew the explosive bolts on the rear of the pod, allowing the force to expel him directly into the airlock. He managed to reach the lever to seal and repressurize the airlock.\n\nBowman took a space helmet and, despite HAL's pleading, began to move toward the mainframe room. Bowman slowly disconnected HAL while ignoring the computer's pleading. HAL began to talk about his life, telling Bowman that one of the first things he was taught was a song; when he asked whether Bowman would like to hear it, Bowman agreed. After HAL was finally shut down, Bowman found a recorded message explaining the true purpose of the mission.\n\nBowman spent several months alone on the Discovery. Eventually the ship reached Jupiter orbit, where Bowman found a large monolith. He reported the finding to Mission Control and then went to examine it in an EVA pod. The monolith unexpectedly opened, and Bowman entered. His last words to Mission Control were \"My God, it's full of stars.\" Bowman passed through the Star Gate, a strange passageway that led him to what looked like a hotel room. He manifested first as an older man and then as a decrepit elderly man before evolving into the Star Child.\n"
}