{
    "Naruto Uzumaki": "Naruto Uzumaki is the son of the Fourth Hokage, Minato Namikaze, and the second Nine-Tails Jinchūriki, Kushina Uzumaki. On the night of Naruto's birth, his parents were attacked by a masked man claiming to be \"Madara Uchiha\" (actually Obito Uchiha). Due to Kushina's weakened seal during childbirth, the Nine-Tails was released and attacked Konoha. In the end, Minato made a fateful decision: he sacrificed his life to seal the Nine-Tails, along with his and Kushina's remaining chakra, into Naruto. This allowed both parents to stay with Naruto and support him during critical moments in his life.\n\nKushina strongly opposed Minato's plan, believing he should not sacrifice himself or burden Naruto with such a heavy responsibility. She felt they should live and raise Naruto together. However, Minato convinced Kushina. The Nine-Tails realized Minato's intent and, during Kushina's weakened state, attempted to kill Naruto. Minato and Kushina sacrificed themselves to protect Naruto. In her dying moments, Kushina tearfully expressed her love for Naruto, marking their first and only time to speak to their child. With the Nine-Tails sealed, Minato and Kushina died heroically, entrusting Naruto to the Third Hokage.\n\nDespite Minato and Kushina's dying wish for the villagers to see Naruto as a hero, this information was kept secret. Only the Third Hokage and a few villagers knew Naruto's true identity, and even Naruto was unaware. Most villagers viewed Naruto as the embodiment of the Nine-Tails, treating him with disdain. Naruto grew up lonely, often causing mischief to gain attention and recognition.\n\nNaruto failed the third graduation exam. Mizuki, an examiner, tricked Naruto into stealing a forbidden scroll, promising he would pass the test. Mizuki's plot was uncovered by Naruto's mentor, Iruka, who risked his life to save Naruto. Naruto learned the Multiple Shadow Clone Technique from the scroll and used it to defeat Mizuki. Recognizing Naruto's potential, Iruka passed him, and Naruto officially graduated, joining the ranks of genin alongside his peers.\n\nNaruto was placed in Team 7 with Sasuke Uchiha and Sakura Haruno, under the leadership of Kakashi Hatake. During the bell test, they initially acted independently and failed. Naruto was tied to a post, and Kakashi forbade Sasuke and Sakura from feeding him. Sasuke broke the rule to feed Naruto, demonstrating team spirit, and they ultimately passed Kakashi's test.\n\nTeam 7's first mission was to escort bridge builder Tazuna to the Land of Waves. Along the way, they encountered enemy ninja from Kirigakure. Naruto, inexperienced and fearful, was poisoned, while Sasuke and Sakura remained calm. Naruto demonstrated his resolve by cutting his hand to bleed out the poison. They then faced the rogue ninja Zabuza Momochi. When Kakashi was trapped in a water prison, Naruto and Sasuke executed a coordinated attack to free him. Kakashi defeated Zabuza and taught Team 7 chakra control exercises. Naruto and Sasuke's rivalry spurred their progress, deepening their bond.\n\nIn the Land of Waves, they stayed with Inari's family. Naruto met a mysterious boy, later revealed to be Haku. Zabuza, accompanied by Haku, returned for revenge. Haku fought Sasuke, while Naruto, having defeated some of Gato's henchmen, rushed in recklessly and fell into Haku's trap. Haku exploited this weakness and attacked Naruto, causing Sasuke to expose a flaw. Despite knowing it was a trap, Sasuke used his own body to shield Naruto, getting severely injured and collapsing. Naruto, mistakenly believing that Sasuke had been killed, unleashed the power of the Nine-Tails in his anger and defeated Haku. Believing Sasuke dead, Naruto, in his rage, unleashed the Nine-Tails' power and defeated Haku. Naruto realized Haku was the boy he had met earlier. Haku, acknowledging his defeat, asked Naruto to kill him but soon left to save Zabuza from Kakashi's fatal blow.\n\nAfter learning of Haku's death, Naruto confronted Zabuza about Haku's loyalty and friendship, bringing Zabuza to tears. Zabuza, moved by Naruto's words, sacrificed himself to kill the villainous Gato. Sasuke soon regained consciousness. Team 7 completed their mission successfully, and Tazuna named the newly built bridge \"The Great Naruto Bridge\" in gratitude for Naruto's help.\n\nKonoha held the Chūnin Exams. In the first round, a written test, Naruto didn't know any of the answers but stayed determined and passed the proctor Ibiki Morino's test. The second round was a survival trial in the Forest of Death, where candidates fought for scrolls to advance. Team 7 encountered Orochimaru, a rogue ninja disguised as a Grass Ninja. Sasuke, terrified of Orochimaru, was about to surrender their scroll, but Naruto's words of encouragement revived his spirit. However, they were still outmatched, and Orochimaru placed the Heaven Curse Mark on Sasuke, who then fell unconscious. Naruto also fainted after Orochimaru sealed his Nine-Tails chakra. After recovering, the team continued the exam, but time was running out. With Kabuto Yakushi's help, they defeated three Rain Ninja and successfully obtained the scroll to pass.\n\nAfter the preliminary matches of the third exam, Naruto received training from Jiraiya, one of the Legendary Sannin. Jiraiya lifted the Five Elements Seal and taught Naruto to control the Nine-Tails chakra and use the Summoning Jutsu. In the elimination rounds, Naruto faced Neji Hyūga, known as a genius. When Neji's attacks blocked Naruto's chakra points, Naruto unleashed the Nine-Tails chakra and defeated Neji, earning cheers from the audience.\n\nDuring Sasuke's match against Gaara, the Sand and Sound ninja began their invasion plan to destroy Konoha. Sasuke chased the retreating Gaara, and Kakashi ordered Naruto and others to stop Sasuke. Gaara unleashed the One-Tail, Shukaku, knocking out Sasuke and Sakura. Naruto, overcoming his fear, fought Gaara and subdued him. Gaara then transformed into Shukaku's full form, prompting Naruto to summon Gamabunta and transform into the Nine-Tails to control Shukaku. Naruto woke Gaara from his slumber, re-sealing Shukaku's power. Naruto ultimately defeated Gaara with a punch, and their conversation resolved Gaara's inner turmoil. Sakura and Sasuke were rescued, and Gaara's team retreated. Upon returning to Konoha, they learned that the Third Hokage had sacrificed his life fighting Orochimaru.\n\nWith the Hokage position vacant, Jiraiya took Naruto to find Tsunade and began teaching Naruto the Rasengan. Tsunade initially mocked Naruto's dream of becoming Hokage, but made a bet that if he mastered the Rasengan in a week, she would give him her necklace. Naruto trained hard to fulfill the promise. During the Sannin battle, Naruto protected Tsunade and severely injured Kabuto with the Rasengan. Touched by Naruto's determination, Tsunade decided to return to the village and become the Hokage, giving her necklace to Naruto and entrusting her hopes to him.\n\nAfter hearing about Naruto's progress, Sasuke felt inadequate and sought greater power to avenge his clan by defeating his brother, Itachi Uchiha. An agitated Sasuke fought Naruto at the hospital. Although Kakashi intervened, Sasuke was shaken by the power of Naruto's Rasengan, feeling even more insecure. Sasuke, persuaded by the Sound Four, decided to join Orochimaru. Despite Konoha's weakened state after the attack, they sent Naruto, Shikamaru, and others to retrieve Sasuke. Before leaving, Naruto promised Sakura to bring Sasuke back.\n\nDuring their pursuit, Naruto's team faced the Sound Four's obstacles, with each member risking their lives to let Naruto catch up to Sasuke. When the stronger Kimimaro appeared, Naruto's Shadow Clones were ineffective, but Rock Lee and Gaara arrived to help, allowing Naruto to continue. Naruto and Sasuke fought at the Valley of the End, where Sasuke declared his intent to kill Naruto. Despite sensing Sasuke's killing intent, Naruto was determined to bring Sasuke back. Their battle was intense, culminating in Naruto's red Rasengan clashing with Sasuke's black Chidori on the waterfall. In the end, Sasuke won but didn't kill Naruto. Naruto, defeated, resolved to become stronger and left with Jiraiya to train.\n\nTwo years later, Naruto returned to Konoha and reformed Team 7 with Kakashi and Sakura. They received an urgent mission to assist Sunagakure and rescue the Kazekage, Gaara. Gaara had died after the Akatsuki extracted his tailed beast. Deidara of the Akatsuki taunted Naruto with Gaara's body. Naruto, calmed by Kakashi, helped defeat Deidara but lost control when he saw Gaara's lifeless body, partially transforming into the Nine-Tails. Kakashi used a seal from Jiraiya to subdue Naruto. Moved by Naruto's genuine friendship, Chiyo sacrificed herself to revive Gaara using the Reanimation Jutsu.\n\nThe higher-ups of Konoha and the leader of \"Root,\" Danzo Shimura, assigned Sai to join Team 7 under the pretense of assisting them, but with the actual mission of eliminating Sasuke. Tsunade appointed Yamato to temporarily replace the recuperating Kakashi as the new captain of Team 7, leading Naruto, Sakura, and Sai to the Tenchi Bridge to gather information on Sasuke and Orochimaru. Although Naruto and Sakura were greatly annoyed by Sai's fake smile and sharp tongue, they were willing to cooperate with someone they disliked for the sake of rescuing Sasuke.\n\nAt the Tenchi Bridge, Team 7 confronted Orochimaru and Kabuto. Provoked by Orochimaru, Naruto's Nine-Tails chakra leaked out, leading to a fierce battle in which Orochimaru retreated due to his body's inability to handle the fight. Naruto, losing control, was subdued by Yamato's Wood Release and reverted to his human form. Feeling guilty for injuring Sakura, Naruto resolved to train harder and protect his loved ones with his own strength, as Yamato advised.\n\nYamato discovered Orochimaru's hideout, and the team infiltrated it, capturing the betraying Sai. When Sai questioned Naruto's determination to save Sasuke, Naruto explained their brotherly \"bond,\" moving Sai to join Team 7's effort. Reuniting with Sasuke, Naruto and Sakura were shocked by Sasuke's cold demeanor and immense power. Sasuke revealed that he spared Naruto's life only on a whim and didn't wish to gain power as Itachi had suggested. Sasuke taunted Naruto, stating that he should train to become Hokage instead of chasing him. Naruto retorted that someone who couldn't save a comrade could never become Hokage. Intending to sever their bond, Sasuke attempted to kill Naruto but was stopped by Orochimaru and Kabuto, who wanted Sasuke's strength to defeat the Akatsuki. Sasuke left with Orochimaru, leaving Team 7's mission a failure, though they gained Sai as a true companion.\n\nNaruto began training to change his chakra nature with Kakashi and Yamato's help, learning his chakra nature was wind. Seeking guidance, Naruto approached Asuma. After Asuma's death in battle with the Akatsuki, Kakashi left Naruto's training to Yamato and joined Team 10 in seeking revenge. Kakashi and Team 10 struggled against Akatsuki member Kakuzu, but Yamato and Naruto's timely arrival turned the tide. Naruto used his new Wind Release: Rasenshuriken to defeat Kakuzu, though the technique severely injured his right hand, leading Tsunade to forbid its further use.\n\nTo gather Akatsuki's intel and find Sasuke, Konoha sent Teams 7 and 8 to hunt down Itachi Uchiha. Naruto's shadow clone encountered Itachi, who, after confirming Naruto's resolve to save Sasuke, implanted a crow inside Naruto and left. The teams then confronted Tobi, who claimed to be Madara Uchiha. Their attacks were ineffective, and Tobi revealed that Sasuke had killed Itachi. Tobi left, taking the exhausted Sasuke with him.\n\nNaruto returned to Konoha to the devastating news of Jiraiya's death at the hands of Pain. Overwhelmed by grief, he found new strength through Iruka and Shikamaru's encouragement. Naruto went to Mount Myoboku to train in Sage Mode. Pain attacked Konoha, destroying the village with Shinra Tensei after learning Naruto was absent. Returning in Sage Mode, Naruto fought Pain with the help of multiple toads. Despite defeating five of the six Paths of Pain, Naruto was captured by the Deva Path. Hinata intervened to protect Naruto but was severely injured, causing Naruto to unleash eight tails of the Nine-Tails' power. The Deva Path's Chibaku Tensei trapped Naruto, but before the Nine-Tails could fully emerge, Minato's chakra appeared and stopped the transformation, revealing his identity as Naruto's father. Minato resealed the Nine-Tails, and Naruto escaped Chibaku Tensei, using Rasengan to defeat the Deva Path. Confronting Pain's real body, Nagato, Naruto's words moved him to abandon his plans and entrust his hopes to Naruto, sacrificing himself to revive the villagers he had killed. Naruto returned to Konoha, welcomed as a hero.\n\nNaruto and Sakura were shocked to learn of Sasuke's alliance with the Akatsuki. Determined to prevent Sasuke's descent into darkness, Naruto pursued the Raikage at the Five Kage Summit, pleading for Sasuke's pardon, even kneeling in desperation, but was harshly rebuffed. In their inn, Naruto encountered Tobi, who revealed the truth behind the Uchiha clan massacre and declared that Sasuke was now driven by hatred for Konoha.\n\nSakura suddenly visited Naruto, confessing her love and urging him to give up on bringing Sasuke back. However, Naruto rejected her, stating, \"This joke isn't funny at all. I hate people who lie to themselves.\" Naruto wanted to reveal the truth about the Uchiha massacre but was stopped by Kakashi. Naruto then told Sakura that he was helping Sasuke out of his own will and that their promise had nothing to do with it, vowing to bring Sasuke back to Konoha. Disappointed, Sakura left.\n\nSai secretly informed Naruto that the Konoha ninja of their generation had decided to assassinate Sasuke, with even Sakura resolving to end things with him. Her confession had been an attempt to dissuade Naruto from bringing Sasuke back to the village. Naruto was shocked by this revelation. Gaara and his group arrived, informing Naruto about Sasuke's rampage at the Kage Summit and Tobi's initiation of the Fourth Great Ninja War. The barrage of grim news weighed heavily on Naruto. Reflecting on his friends' decisions and Gaara's words—\"If you are ready to bear the name of Hokage, as Sasuke's friend, you should do what you must\"—Except for Naruto, who still insisted on bringing Sasuke back, everyone else decided to give up Sasuke. Also, Sasuke's actions against all the villages became too much for Naruto to bear, Naruto became overwhelmed and collapsed from hyperventilation.\n\nAfter killing Danzo, Sasuke fought Kakashi but suffered severe vision impairment from overusing his Sharingan. Sakura attempted to kill Sasuke but hesitated and was captured by him. Naruto arrived just in time to save her. Their confrontation at the Valley of the End was evenly matched. Naruto told Sasuke, \"I'm the only one who can bear your hatred. I'll take your hatred and die with you.\" Confused by Naruto's persistence, Sasuke asked, \"What exactly do you want? Why are you so obsessed with me?\" Naruto replied, \"Because we are friends.\" Despite Sasuke's declaration that he wouldn't change his mind and would kill Naruto, Naruto insisted that they would die together and that in death, without being the Nine-Tails Jinchuriki and an Uchiha, they could finally understand each other. Naruto then offered to be Sasuke's first target for revenge. Sasuke, determined to start by killing Naruto, left with Tobi using space-time ninjutsu.\n\nFollowing the Great Toad Sage's suggestion, Naruto sought out Killer Bee, the Eight-Tails Jinchuriki. Under Bee's guidance, Naruto confronted his inner darkness at the Falls of Truth and succeeded in overcoming it. Bee then agreed to help Naruto control the Nine-Tails. In the depths of his consciousness, Naruto battled the Nine-Tails but was nearly consumed by its hatred. At the crucial moment, his mother Kushina's chakra appeared, aiding Naruto in subduing the Nine-Tails and controlling its chakra. Kushina revealed herself as the previous Nine-Tails Jinchuriki and disclosed the truth behind the Nine-Tails' attack on Konoha sixteen years ago. Grateful, Naruto vowed to surpass his parents and returned to reality.\n\nNaruto and Killer Bee headed to the battlefield of the Fourth Great Ninja War. They encountered the reanimated Nagato and Itachi. After breaking free from Kabuto's control, Itachi helped seal Nagato and entrusted Sasuke's fate to Naruto.\n\nNaruto and Killer Bee faced Tobi, who led a group of reanimated Jinchuriki. Overwhelmed, they received reinforcements from Kakashi and Guy. During the battle, Naruto entered the inner world of the tailed beasts, winning their trust, including that of Kurama, the Nine-Tails. He became the second person after the Sage of Six Paths to be acknowledged by the tailed beasts. Achieving true tailed beast transformation for the first time, Naruto, along with Kurama, Killer Bee, Kakashi, and Guy, fought Tobi. Attempting to prevent the revival of the Ten-Tails, they attacked Tobi. Eventually, Kakashi deciphered Tobi's space-time jutsu and shattered his mask, revealing him as Kakashi's former comrade, Obito Uchiha.\n\nMadara, released from the Reanimation jutsu, joined Obito in battle. Together, they successfully revived the Ten-Tails. The Allied Shinobi Forces arrived, uniting against the Ten-Tails. Despite their efforts, the Ten-Tails' immense power resulted in severe casualties, including Neji, who sacrificed himself to protect Naruto and Hinata. Nearly despairing from Obito's taunts, Naruto was revived by Hinata's encouragement and Kurama's scolding. Naruto distributed Kurama's chakra to the Allied Shinobi Forces, adjusting it to suit each individual, thereby boosting their strength for the continued fight.\n\nObito returned from the alternate dimension and absorbed the Ten-Tails, becoming its jinchuriki. Faced with this unprecedented enemy, Naruto, Sasuke, and the previous Hokage combined their efforts to launch an effective attack using Sage Art: Rasengan. Obito then unleashed the God Tree, absorbing the chakra of many ninja, leading to significant casualties among the Allied Shinobi Forces. As Naruto's resolve wavered, Sasuke's determination helped him regain confidence. Together, they battled Obito, the Ten-Tails jinchuriki, and with the support of the Allied Shinobi Forces, they eventually defeated Obito and Naruto managed to redeem him, successfully extracting the tailed beasts from his body.\n\nSubsequently, Madara forced Obito to use the Samsara of Heavenly Life Technique to resurrect him. Madara then hunted down the nine tailed beasts, using his Rinnegan to subdue and absorb them into the Gedo Statue. Naruto was left near death after the Nine-Tails was extracted from his body. Gaara, at Kurama's request, brought the dying Naruto to Sakura, who used all her strength to save him. Naruto was then taken to the alternate dimension by Kakashi. Obito followed and transferred the Yin half of Kurama, along with some chakra from the One-Tail and Eight-Tails, into Naruto. In the spiritual realm, Naruto met the legendary Sage of Six Paths, Hagoromo Otsutsuki, learned about the origins of everything, and discovered that he was the reincarnation of Hagoromo's younger son, Asura. After a conversation with the Sage, Naruto and Sasuke chose their paths and received his power.\n\nUpon awakening, Naruto acquired the Six Paths Sage Mode, bestowed with the \"Yang Power\" sealing technique by the Sage of Six Paths and the chakra of all nine tailed beasts. Naruto and Sasuke then challenged Madara together. As Madara was overwhelmed, he entered the alternate dimension and retrieved the other Rinnegan from Obito. Returning, he initiated the Infinite Tsukuyomi.\n\nAs the Infinite Tsukuyomi began, Naruto, desperate to save his comrades from the genjutsu, tried to charge out of Sasuke's Susanoo, which was blocking the moon's light. Sasuke stopped him, stating that Sakura and Kakashi were burdens, which angered Naruto. Suddenly, Black Zetsu pierced through Madara from behind, declaring himself the will of Kaguya Otsutsuki, the progenitor of chakra, and used Madara's body to resurrect her. Despite Naruto and Sasuke's attempts to stop her, they were overpowered by her immense chakra.\n\nThey were transported and found themselves above a sea of lava. In the nick of time, Sasuke summoned a hawk to save the falling Naruto. Sasuke explained that saving Naruto was necessary to seal Kaguya, while rescuing Kakashi and Sakura was merely incidental. Naruto reminded Sasuke of the time he risked his life to protect him from Haku, suggesting that Sasuke's actions were instinctive. Kaguya then launched her attack, and the duo fought together. Black Zetsu recounted Kaguya's past, admitting to manipulating Indra and Asura's conflict and altering the Sage's stone tablet to revive Kaguya.\n\nKaguya used her All-Killing Ash Bones technique in the supergravity space to end the battle. Obito sacrificed himself to protect Naruto and Sasuke, securing precious time for Sasuke's ocular powers to recover and reigniting Naruto's fighting spirit. Before dying, Obito infused his chakra into Kakashi, granting him temporary Mangekyo Sharingan abilities. Under Kakashi's leadership, Team 7 executed a flawless plan, ultimately sealing Kaguya.\n\nAfter Kaguya's sealing, Hagoromo dispelled the Reanimation Jutsu and summoned the departed souls back to the Pure Land. Naruto hurried to his father, the Fourth Hokage Minato. Minato smiled and wished Naruto a happy birthday. With tears in his eyes, Naruto expressed all the things he hadn't been able to say before and asked Minato to convey these words to his mother. Minato replied, \"I will definitely tell her,\" and then his soul returned to the Pure Land.\n\nHagoromo expressed his hope that Naruto and Sasuke would cooperate to release the Infinite Tsukuyomi, but Sasuke declared his intention to initiate a \"revolution,\" vowing to execute the current Kage and using genjutsu and Chibaku Tensei to seal the nine tailed beasts. Determined to stop Sasuke, Naruto followed him to the Valley of the End for their fateful final battle.\n\nSasuke rejected Naruto's approach to achieving peace, believing that true peace required him to bear the world's hatred alone, becoming a common enemy for the shinobi world to unite against. To complete this goal, Sasuke needed to sever his last bond by killing Naruto. Their battle at the Valley of the End was intense and evenly matched. In the end, both used their ultimate techniques, resulting in mutual destruction of their arms and the shattering of the statues of Hashirama and Madara.\n\nExhausted and injured, they lay on the ground. Sasuke, puzzled by Naruto's persistence, asked why he went to such lengths for him. Naruto replied, \"Because you are my friend. Seeing you burdened and lost pains me. I can't ignore it.\" Despite their exhaustion and blood loss, Sasuke glimpsed Naruto's memories, acknowledging his defeat and Naruto's unyielding resolve. He admitted his loss and intended to atone by ending his own life. Naruto stopped him, insisting Sasuke live and help him. Sasuke questioned what would happen if he opposed Naruto again, to which Naruto replied he would stop him but was confident Sasuke wouldn't do that. When Sasuke asked why, Naruto reiterated that they were friends. Moved, Sasuke shed tears, and their blood formed a seal of reconciliation.\n\nAfter recovering in the village, Sasuke informed Kakashi and Sakura of his plans to journey the world to see what he had missed while blinded by hatred. He declined Sakura's offer to accompany him, promising to return. Shortly after leaving the village, Naruto appeared before Sasuke, returning the Konoha forehead protector Sasuke had once left behind. Sasuke accepted it, promising to fulfill his duties as a ninja. The two friends parted ways.\n",
    "Sasuke Uchiha": "Naruto's acknowledged friend, rival, and goal shares a brotherly bond with him. Having experienced the Uchiha clan massacre as a child, Sasuke, like Naruto, grew up alone. Initially, Naruto disliked Sasuke because Sasuke was popular with girls and an excellent student. After being assigned to Team 7 together, despite Sasuke's aloofness, they gradually developed a friendship through mutual competition, making Sasuke Naruto's first friend. Sasuke left Konoha to seek revenge against Itachi Uchiha, but Naruto was determined to bring him back. They fought in the Valley of the End, and despite Sasuke's intent to kill, Naruto remained steadfast in his desire to return Sasuke to Konoha. The battle ended with Sasuke's victory, but he did not kill Naruto.\n\nSasuke plunged into darkness, seeking greater power and revenge, standing in opposition to the village. Upon learning the truth behind the Uchiha massacre, Sasuke decided to destroy Konoha. After killing Danzo, Sasuke met Naruto again. Naruto, now aware of the truth, understood Sasuke's resolve for revenge but still did not give up on bringing him back. After conversing with the reanimated Itachi, Sasuke began to ponder the concepts of family, village, and ninja. After speaking with the past Hokage, Sasuke decided to become Hokage himself to initiate change. Sasuke and Naruto fought together during the Fourth Great Ninja War, and after defeating Kaguya Otsutsuki, they faced off in their fated battle at the Valley of the End. Sasuke believed he needed to bear all the world's hatred alone and become the common enemy to unite people. Naruto was his only remaining bond, and Sasuke thought he needed to kill Naruto to achieve his goal. They fought with all their might, each losing an arm in the process. While severely injured and immobile, they conversed. Sasuke questioned Naruto's persistence and the meaning of friendship to him. After hearing Naruto's thoughts and seeing his memories, Sasuke finally acknowledged Naruto and admitted defeat. Wanting to die, Sasuke was persuaded by Naruto to return. After recuperating, Sasuke left Konoha, deciding to observe the world with his own eyes.\n",
    "Obito Uchiha": "In his youth, Obito was very similar to Naruto: kind-hearted and passionate, often late due to helping elders multiple times. He was called the \"dead last\" of the Uchiha clan, but Obito was determined, always striving for recognition from others and aiming to become Hokage. During the Third Great Ninja War, Minato's squad was tasked with destroying the Kannabi Bridge. On the way, Rin was captured. Obito wanted to rescue her, but Kakashi, due to his father's experience, decided to prioritize the mission and abandon Rin. Enraged, Obito punched Kakashi and chose to rescue Rin on his own. Before leaving, he told Kakashi, \"In the world of ninjas, those who break the rules are scum, but those who abandon their comrades are worse than scum!\" The two of them teamed up to rescue Rin from a cave. However, as they were escaping, Obito pushed Kakashi out of the way to save him but got crushed himself, left dying. Before his death, Obito had Rin transplant his intact left eye to Kakashi, telling him, \"Let me be your eye and help you see the future.\" He also urged Kakashi to protect Rin well. The three parted ways, with Obito being presumed dead, and his name was inscribed on Konoha's Memorial Stone. Obito was saved by Madara Uchiha, who tempted him to help with his plans, but Obito refused, wanting only to return quickly.\n\nOne day, Obito learned from White Zetsu that Rin and Kakashi were under attack by Mist ninjas, so he decided to go rescue them, with Madara not stopping him. However, upon reaching the location, Obito witnessed Kakashi's Chidori piercing through Rin's chest. Both of their Sharingan then awakened into Mangekyo Sharingan, and Kakashi subsequently fell unconscious. Overwhelmed by grief and rage, Obito slaughtered the Hidden Mist Anbu present using Wood Release, and began to question everything about the ninja world. In truth, everything was orchestrated by Madara to drive Obito into darkness by making him witness his beloved comrade's brutal death. Driven by grief, Obito returned to Madara and embraced his ideology: \"Use the Ten-Tails' chakra to cast a massive genjutsu, Infinite Tsukuyomi, to control all humanity and create an ideal world without war, where Rin would also be 'revived' in the genjutsu world.\" Thus, Obito embarked on a path of darkness.\n\nObito later assumed the identity of Madara Uchiha and attacked Konoha on the day Naruto was born, resulting in the deaths of his teacher, the Fourth Hokage Minato Namikaze, and Minato's wife (Naruto's parents). He was the leader behind the Akatsuki organization, and at the Five Kage Summit, he declared the start of the Fourth Great Ninja War. During the Fourth Great Ninja War, Obito, as the Ten-Tails' jinchuriki, inflicted massive casualties on the Allied Shinobi Forces. In battle, due to the chakra resonance of the tailed beasts, Naruto and Obito connected, allowing Naruto to see Obito's memories and converse with him in the mental space. Naruto believed that he and Obito were very similar: both did not know their parents, lost important people, and worked hard to gain others' recognition, aspiring to become Hokage. Naruto concluded that Obito could not truly discard his past and memories with comrades, but was wearing a mask to escape reality. Obito's actions went against the Hokage's path, and even those he valued would not agree with his way. Naruto said that Obito actually still wanted to become Hokage and should join their side. Seeing his fantasy of becoming Hokage and being recognized in Konoha, along with Naruto's words, Obito began to waver. After being defeated, Minato stopped Kakashi from killing Obito, and the remaining members of Team 7 began to talk. Through Kakashi's heartfelt words, Obito finally awakened.\n\nWhen Naruto was on the brink of death after having the Nine-Tails extracted, Obito saved him. After Kaguya Otsutsuki's revival, Obito helped Naruto and Sasuke in their fight against her. When Kaguya attempted to kill Sasuke and Naruto, Obito and Kakashi stood in front of them, blocking the attack. To save Kakashi, Obito redirected the attack aimed at Kakashi and showed a bright smile reminiscent of his youth, telling Kakashi, \"Stay here for now; don't go to that world too soon.\" After being hit, Obito's body began to disintegrate into fragments. Before disappearing completely, Obito made a self-deprecating remark about his life, acknowledged Kakashi as the pillar of the new era, and refused Naruto's attempt to save him. Finally, he smiled and said to Naruto, \"You must become Hokage.\"\n\n"
}