{
    "Paul Vitti": "Paul Vitti, a former mob boss, faced threats to his life from assassins and corrupt guards while nearing the end of his sentence at Sing Sing prison. He began singing songs from \"West Side Story\" in an attempt to get the attention of psychiatrist Ben Sobel, who had previously hung up on him during his father's funeral. After Ben conducted psychological tests on him, Paul's mental state appeared to deteriorate. The FBI agreed to temporarily release Paul for a month into Ben's custody for further therapy. As Ben drove Paul away from prison, Paul immediately confessed that he had been pretending all along.\n\nPaul attempted to find legitimate work (trying out at a car dealership, a restaurant, and a jewelry store), but his rude demeanor and paranoia only complicated matters, resulting in him being fired each time. Meanwhile, Paul was informed by his de facto boss Patti LoPresti that the Rigazzi family wanted him dead. In response, he declared he was \"out\" and sought new employment opportunities. Eventually, he found a job as a technical advisor on the set of a mafia TV series.\n\nBoth mafia factions continued to target Paul, making his choices increasingly difficult and putting his own safety at risk. In his cunning manner, Paul meticulously planned a scheme. He first agreed to assist a Hollywood producer as an advisor on a mafia film, using this role to execute his plan. Paul planned a major armored car heist in collaboration with LoPresti to frame the Rigazzi family. Ben discovered Paul's involvement in the heist and tried to intervene and persuade him against it, but Paul insisted on proceeding, and Ben reluctantly joined the operation.\n\nThe team ambushed the armored car using smoke grenades, lifted it over a fence amidst the chaos, and successfully stole over $22 million in gold bullion. However, LoPresti's men unexpectedly betrayed them, revealing they had been working for the Rigazzi family all along.\n\nIn a fit of anger, Ben attacked one of them, while Paul's men apprehended the others. They used the stolen gold bullion to incriminate the Rigazzi family, locking three of their men inside the armored truck suspended from a crane. This led to the arrest of the entire Rigazzi family, thereby preventing a mafia war.\n\nFinally, Paul met with Ben near bridges on the New York waterfront, and they parted ways as friends, singing another song from \"West Side Story\" together.",
    "Ben Sobel": "Ben is a good person. Paul is the most challenging patient of his career. When Paul's mental state deteriorated, Ben was entrusted to continue his treatment outside of prison. He worked hard to persuade Paul to abandon his gangster life and seek a normal job and lifestyle.\n\nSome time later, FBI agents informed Ben that Paul had reassembled his old crew and might be planning significant events. This raised Ben's suspicions, prompting him to visit Paul. During a car chase with Rigazzi family hitmen, both men found themselves in trouble, and Paul ultimately escaped. The FBI blamed Ben and gave him 24 hours to find Paul.\n\nThrough Ben's son Michael, who now worked as Paul's driver, Ben eventually located Paul. He discovered Paul was planning a large-scale armored car heist in collaboration with Lopezesti. Ben attempted to intervene and dissuade Paul, but Paul insisted on proceeding. Ben reluctantly joined the operation, trying to maintain control and prevent violence. During the heist, Ben became enraged at the actions of the heist team, especially when Patty Lopezesti's henchmen betrayed them. In a fit of anger after the sudden betrayal during the heist, Ben struck one of Lopezesti's henchmen. Ultimately, his involvement helped thwart the Rigazzi family's scheme and prevented a gang war.\n\nBen met Paul and Jerry on a bridge near the waters of New York, and they parted ways as friends, singing \"West Side Story\" together once again."
}