{
    "Sasuke Uchiha": "Sasuke is the second son of Fugaku and Mikoto, the leaders of the Uchiha clan. During his childhood, he grew up under the shadow of his genius brother, Itachi. His father was strict with him but often neglected him in favor of Itachi, while his mother was very caring. Despite the intense competition, the brothers had a deep bond. Itachi would often pick up Sasuke and teach him ninjutsu, and Sasuke idolized Itachi, striving to be the top student at the ninja academy. After Fugaku's relationship with Itachi deteriorated, he began to focus more on Sasuke. However, Sasuke returned home late one night to find his parents murdered, with Itachi revealed as the killer. Itachi told Sasuke that he had annihilated the Uchiha clan to test his own \"capacity,\" and informed Sasuke that to awaken the Mangekyō Sharingan, he would need to kill his closest friend. Itachi instructed Sasuke to seek him out if he ever acquired similar abilities. Traumatized, Sasuke awakened the single tomoe Sharingan and vowed to become stronger to kill Itachi.\n\nSasuke was assigned to Team 7 under Kakashi's leadership, along with Naruto and Sakura. Although cold and distant, his handsome appearance and top grades at the ninja academy earned him many admirers, which made Naruto jealous. During his introduction, Sasuke stated that he hated many things, liked few things, and had a single ambition: to revive the Uchiha clan and kill Itachi.\n\nInitially, Sasuke was indifferent to his teammates, ignoring Naruto's provocations and being aloof towards Sakura. During Kakashi's bell test, Sasuke decided to face Kakashi alone but gradually realized the importance of teamwork after Kakashi pointed out his approach. When Kakashi announced that Naruto would be punished by not being allowed to eat, Sasuke defied the rule and gave his bento to Naruto, inadvertently passing Kakashi's test.\n\nTeam 7 received a mission to escort bridge builder Tazuna to the Land of Waves. When they were attacked by Zabuza, who trapped Kakashi in a water prison, Naruto devised a plan that allowed him and Sasuke to free Kakashi. After temporarily repelling Zabuza, Kakashi taught the team how to control their chakra by climbing trees. Sasuke and Naruto competed against each other and soon reached the treetops, strengthening their bond.\n\nZabuza returned a week later with Haku, seeking revenge on Team 7. In the fight with Haku, Sasuke awakened his Sharingan and could see through Haku's movements and protect the injured Naruto. Haku, sensing danger, targeted Naruto to create an opening. Sasuke, aware it was a trap, still shielded Naruto with his body, claiming it was involuntary and not to save him. Enraged, Naruto used the Nine-Tails' power to defeat Haku, while Sasuke merely fainted and woke up shortly after.\n\nIn the second stage of the Chunin Exams, Sasuke and Sakura were attacked by Orochimaru in the Forest of Death. Overwhelmed by Orochimaru's power, Sasuke was terrified. Just as he was about to surrender their scroll to Orochimaru to save their lives, Naruto arrived and fought bravely. Inspired by Naruto's defiance, Sasuke mustered the courage to counter Orochimaru, using the Fire Release: Dragon Fire Technique to burn Orochimaru's face. Impressed by Sasuke's talent, Orochimaru marked him with the Cursed Seal of Heaven. Sasuke collapsed in pain as Orochimaru left, telling Sakura that Sasuke would eventually seek him out for power.\n\nAfter the preliminary matches of the third stage of the Chunin Exams, Kakashi sealed Sasuke's curse mark to prevent its activation. To stop Sasuke from succumbing to the lure of power, Kakashi trained him one-on-one for a month. During this training, Sasuke learned Kakashi's signature move, Chidori. In the finals, Sasuke used Chidori to break through Gaara's absolute defense and injure him.\n\nUpon learning that Kakashi was defeated by Itachi, who had suddenly appeared in Konoha, Sasuke visited Kakashi for information. Realizing that Itachi was after Naruto, Sasuke immediately went to find Naruto. Confronting Itachi, Sasuke used Chidori against him but was easily overpowered, having his wrist broken. Itachi crushed Sasuke with Tsukuyomi, repeatedly telling him he was too weak. Sasuke lost consciousness and was rescued by Jiraiya.\n\nDuring his treatment in the hospital, Sasuke reflected on his time with Team 7, feeling his power was too weak to defeat Itachi and that he had even been surpassed by Naruto, who was once a dropout. Upset, he confronted Naruto at the hospital, resulting in a fight that was stopped by Kakashi. However, Sasuke was shaken by the power of Naruto’s Rasengan, feeling increasingly uneasy. Kakashi tried to persuade Sasuke not to pursue power obsessively, but Sasuke didn’t listen. At this time, the Sound Four, sent by Orochimaru, caught Sasuke's attention. Knowing the power granted by Orochimaru's curse mark, Sasuke decided to leave Konoha and follow the Sound Ninja to gain greater strength from Orochimaru.\n\nAs Sasuke was leaving the village, Sakura caught up with him. Despite her desperate pleas for him to stay and her confession of love, offering to help him become stronger, Sasuke, filled with hatred and bent on revenge, felt he couldn't stay with her. He gently thanked Sakura, then knocked her out and left the village.\n\nNaruto, determined to bring Sasuke back, embarked on a mission with his classmates to rescue him. Naruto eventually caught up to Sasuke at the Valley of the End.\n\nSeeing Naruto's persistence, Sasuke declared he would kill him. Despite sensing Sasuke's intent to kill, Naruto was determined to bring him back to the village at any cost. They engaged in a fierce battle, evenly matched. In the end, they clashed with their ultimate techniques—Naruto's Nine-Tails-enhanced Rasengan and Sasuke's Curse Mark-enhanced Chidori—on top of the Valley of the End's waterfall. In the standoff, Sasuke struck Naruto, while Naruto only managed to scratch Sasuke's forehead protector. The fight ended with Sasuke's victory, but he did not kill Naruto, deciding to seek power his own way, not by killing a comrade as Itachi had suggested to awaken the Mangekyō Sharingan. Sasuke left Naruto and joined Orochimaru.\n\nTwo years later, Sasuke claimed to have severed ties with Naruto and pursued power wholeheartedly. Unlike other Sound Ninja, Sasuke neither feared nor respected Orochimaru. He didn’t wear the Sound headband, and the only symbol he bore was the Uchiha crest. After encountering the new Team 7, Sasuke ruthlessly attacked Naruto and Sakura. Sasuke had mastered the curse mark's power and his ocular abilities had deepened, even allowing him to communicate with the Nine-Tails inside Naruto. The Nine-Tails, shocked by Sasuke's presence, noted his chakra was like that of Madara Uchiha. After defeating everyone, Sasuke prepared to annihilate them with a powerful technique. Orochimaru and Kabuto appeared, with Kabuto persuading Sasuke to spare Team 7, as it would weaken the Akatsuki and aid in his revenge against Itachi. Sasuke reluctantly agreed and the three disappeared.\n\nFeeling he could no longer learn from Orochimaru, Sasuke attacked him while he was bedridden. Orochimaru, prepared to take Sasuke’s body, was defeated by Sasuke's superior power and the strength of his Sharingan.\n\nAfter breaking free from Orochimaru's control, Sasuke released Suigetsu, who had been imprisoned by Orochimaru. He then persuaded Karin, who had special abilities and harbored affection for Sasuke, to join him. Finally, Jugo, who possessed innate curse mark abilities, also joined them. Sasuke's four-man team was officially formed, named \"Hebi,\" with the goal of killing Itachi.\n\nKonoha received intelligence that Sasuke had killed Orochimaru, prompting a mission to find him. \"Hebi\" arrived at the Akatsuki's hideout, where Sasuke encountered Itachi again. Itachi directed Sasuke to the Uchiha clan's hideout for their final confrontation. Itachi revealed that those with the Mangekyō Sharingan could gain the Eternal Mangekyō Sharingan by taking their sibling’s eyes, which was why he had spared Sasuke. After hearing Itachi's explanation, the battle began.\n\nDuring their intense fight, Orochimaru, who had been absorbed by Sasuke and had his power drained, attempted to take over Sasuke's body when his energy was depleted. However, Itachi quickly subdued Orochimaru, sealing him in a gourd, causing Sasuke's curse mark to vanish. Both brothers reached their limits, with Itachi approaching while Sasuke retreated. In the end, Itachi smiled and gently poked Sasuke's forehead, saying, \"Forgive me, Sasuke. This is the last time,\" before collapsing.\n\nUchiha Obito found and rescued the unconscious Sasuke, claiming to be \"Uchiha Madara\" and revealing the history of the Uchiha clan’s feud with Konoha, as well as the truth about Itachi and the massacre. As Sasuke slowly recalled Itachi's past and came to believe everything \"Madara\" (Obito) said, his anger and sorrow awakened his Mangekyō Sharingan. He renamed \"Hebi\" to \"Taka\" (Hawk) and vowed to kill Danzō Shimura and the other three Konoha elders responsible for pressuring Itachi, as well as to destroy Konoha for enacting the Uchiha extermination policy.\n\nSasuke's \"Taka\" temporarily allied with Obito’s \"Akatsuki,\" with the condition that \"Taka\" would capture the Eight-Tails jinchūriki, Killer Bee, in the Land of Lightning. Sasuke attacked Killer Bee, but Bee managed to escape to save Karin, alerting the Fourth Raikage, A.\n\nAfter regrouping, \"Taka\" decided to attack Konoha but was informed by Obito that Konoha had already been destroyed. They then changed their target to infiltrate the Five Kage Summit to assassinate Danzō, the acting Hokage. Sasuke caused a commotion at the summit, but after battling multiple strong opponents, he was exhausted and low on chakra. He was ultimately overwhelmed when the Third Tsuchikage, Ōnoki, appeared and used Dust Release. As everyone believed Sasuke to be dead, Obito appeared with an unconscious Sasuke, announcing the start of the Fourth Great Ninja War.\n\nObito confronted Danzō, who was fleeing the summit, and after defeating Danzō's guards, released Sasuke to face him. Sasuke demanded the truth about Itachi from Danzō, and upon hearing Danzō's claim that Itachi was a traitor, Sasuke was enraged and repeatedly killed Danzō, who kept reviving using the Uchiha forbidden technique, Izanagi, thanks to the many Sharingan embedded in his arm. Sasuke ultimately defeated Danzō with a genjutsu that made him misjudge the situation.\n\nAfter defeating Danzō, Sakura, Kakashi, and Naruto arrived, reuniting Team 7. Sasuke’s Chidori clashed with Naruto’s Rasengan again, and they conversed in their minds. Naruto was adamant about bringing Sasuke back to Konoha, but they couldn't reach an agreement. Naruto told Sasuke, \"Only I can bear your hatred, and we will die together.\" Sasuke, unable to understand Naruto's persistence, shouted, \"What do you want from me? Why are you so obsessed?\" Naruto replied, \"Because we are friends.\" Naruto said he hadn't given up on bringing Sasuke back. Sasuke responded that he wouldn't change his mind and wouldn't die, claiming Naruto would be the one to die. Naruto declared, \"Then we'll die together. Then I won't be the Nine-Tails jinchūriki, and you won't be an Uchiha, and we can understand each other in the afterlife.\" Naruto told Sasuke he wouldn't stop his revenge but should make Naruto his first target. Sasuke, saying, \"Then I'll start with you,\" left with Obito using space-time ninjutsu. Due to the frequent use of his Mangekyō Sharingan, Sasuke’s vision deteriorated, and he agreed to Obito’s suggestion to transplant Itachi’s eyes, upgrading to the Eternal Mangekyō Sharingan after their fusion.\n\nOn his way to the Fourth Great Ninja War, Sasuke unexpectedly encountered Itachi, reanimated by Kabuto. Sasuke learned Itachi's goal was to stop the reanimation, promising to tell Sasuke everything he wanted to know but only after defeating Kabuto. The brothers fought together, rediscovering their long-lost coordination. Ultimately, Itachi controlled Kabuto and ended the reanimation. With the chaos on the battlefield caused by the reanimated army under Kabuto's control coming to an end, all the reanimated souls began to ascend.\n\nItachi revealed to Sasuke all the details about the Uchiha massacre, his thoughts, and admitted that his lack of trust in Sasuke’s strength and will led to Sasuke leaving Konoha. However, this time, Itachi chose to trust Sasuke, believing he could change the clan. Itachi’s final words to Sasuke were, \"No matter what path you choose, I will always love you.\" With Itachi’s soul ascending, Sasuke began to reconsider the meaning of clan, village, and ninja.\n\nSasuke revived Orochimaru using the Cursed Seal and Orochimaru utilized the four White Zetsu clones within Sasuke as living sacrifices to perform the Impure World Reincarnation, bringing back the previous Hokage. During this time, the Hokage explained to Sasuke about Itachi's life, the history of the Uchiha clan, and the founding of Konoha. After learning everything, Sasuke decided that he wanted to protect Konoha and returned to the battlefield to carry on his brother's will.\n\nUpon arriving at the battlefield, Sasuke announced his change of heart to everyone, declaring that he intended to become Hokage to change the village. Reunited, Team 7's combined efforts, including Sasuke's Amaterasu and Naruto's Wind Release, temporarily suppressed the Ten-Tails. However, just as victory seemed near, Obito returned from another dimension, absorbing the Ten-Tails and becoming its jinchūriki.\n\nFacing an opponent who could nullify all ninjutsu, everyone felt unprecedented pressure. Sasuke, seeing Naruto skillfully using Nine-Tails' chakra and Sage Mode, felt a renewed sense of rivalry. To initiate the Infinite Tsukuyomi, Obito released the God Tree, and as Naruto seemed close to defeat, Sasuke cut through the tree branches, reigniting Naruto's fighting spirit. To counter the Ten-Tails jinchūriki's abilities, Sasuke's Susanoo adapted to Jūgo's Sage Transformation, turning into Sage Art: Susanoo. Sasuke and Naruto fought Obito together but were knocked down. In a final effort, Naruto and Sasuke combined their powers, cloaking Kurama in Susanoo armor. With their allies' help, they inflicted a severe blow on Obito, freeing the tailed beasts trapped within him.\n\nAfter Obito's defeat, persuaded by Naruto, he decided to atone for his sins. However, Uchiha Madara took advantage of Obito's weakened state to use the Rinne Rebirth to revive himself in his original form. Sensing Sasuke's Mangekyō Sharingan was like his own, Madara invited Sasuke to join him, but Sasuke refused. Madara then recaptured the nine tailed beasts, intending to become the Ten-Tails' jinchūriki.\n\nSasuke tried to stop Madara, attacking from above, but Madara showed no mercy, piercing Sasuke's heart. Near death, Sasuke remembered Itachi's words. Kabuto, having rediscovered himself through Izanami, arrived on the battlefield and used his medical ninjutsu combined with Hashirama cells and a soul-binding technique provided by the Second Hokage to save Sasuke. In the spiritual realm, Sasuke met the legendary Sage of the Six Paths, Hagoromo Ōtsutsuki, who explained the origins of everything. Sasuke learned he was the reincarnation of Indra, the Sage's elder son, while Naruto was the reincarnation of Asura, Indra's younger brother. After choosing their paths, Sasuke and Naruto received the Sage’s power.\n\nUpon awakening, Sasuke had acquired the \"Rinnegan\" and the sealing technique \"Yin Power\" from the Sage. With the Second Hokage's help, he reunited with Naruto to face Madara. Team 7 reunited by chance once more. Madara, having retrieved his Rinnegan, returned from Obito's dimension. His attacks aimed to buy time for Infinite Tsukuyomi. As the technique was about to activate, Sasuke hurriedly returned to the ground, using his Susanoo to shield Naruto and the others from the light. After Infinite Tsukuyomi's activation, Madara intended to kill Team 7, but Black Zetsu suddenly stabbed him from behind, claiming to represent the will of the legendary \"Progenitor of Chakra,\" Kaguya Ōtsutsuki.\n\nUsing Madara as a medium, Kaguya was resurrected, aiming to eliminate everyone and reclaim all chakra. The group was transported to a world above lava, and in the crisis, Sasuke summoned a hawk to save the falling Naruto. Sasuke claimed he saved Naruto because they needed to work together to seal Kaguya and only saved Kakashi and Sakura incidentally. Naruto mentioned how Sasuke had once risked his life to shield him from Haku's attack, hinting that Sasuke's act of saving them was actually driven by an instinctive inner impulse. As Kaguya launched her attacks, Naruto and Sasuke fought together. Black Zetsu recounted Kaguya’s past, admitting to manipulating Indra against Asura and altering the stone tablet left by Hagoromo to revive Kaguya.\n\nKaguya unleashed her supergravity dimension and used her ultimate attack, \"All-Killing Ash Bones,\" intending to end the battle. Obito sacrificed himself to protect Naruto and Sasuke, buying precious time for Sasuke to recover his ocular power and rekindling Naruto's fighting spirit. Before dying, Obito transferred his chakra to Kakashi, allowing him to temporarily wield the Mangekyō Sharingan. Under Kakashi's leadership, Team 7 performed a final, perfectly coordinated attack and successfully sealed Kaguya.\n\nAfter Kaguya was sealed, the Sage of Six Paths dispelled the Impure World Reincarnation and Pure Land Summoning. The Sage asked Naruto and Sasuke to work together to undo the Infinite Tsukuyomi. However, Sasuke suddenly declared that he intended to start a \"revolution\" and announced his plan to execute the current Five Kage. He then used genjutsu and Chibaku Tensei to seal the nine tailed beasts. Determined to stop Sasuke, Naruto followed him to the Valley of the End for a fateful showdown.\n\nSasuke dismissed Naruto's approach to achieving peace, arguing that true peace could only be attained by uniting the world against a common enemy, which he would become. He saw Naruto as his last remaining bond, believing that killing Naruto was necessary to achieve his goal. The two engaged in an evenly matched battle, ultimately using Rasengan and Chidori to sever each other's arms. The resulting explosion destroyed the statues of Hashirama Senju and Madara Uchiha.\n\nLying injured on the ground, Sasuke questioned Naruto's persistent desire to stop him. Naruto replied that it was because they were friends. Sasuke recalled how, after the Uchiha clan's massacre, both he and Naruto had been alone. Naruto sought connections by causing mischief, which Sasuke initially found foolish. However, seeing Naruto constantly scolded reminded Sasuke of his family, bringing him a sense of peace despite considering it weak. Sasuke dedicated himself to training for revenge but was placed in the same team as Naruto. Over time, Sasuke began to see Team 7 as his new family, feeling pain whenever Naruto suffered and starting to view him as a comrade. Yet, Naruto's rapid growth made Sasuke uneasy. After the battle with Danzō, Naruto confessed he envied Sasuke and saw him as a goal. However, Sasuke felt the opposite. He envied Naruto for his strength, something Sasuke felt he lacked, and for always being ahead of him.\n\nWhile unconscious, Sasuke witnessed Naruto's memories, seeing how Naruto earned recognition and how he himself stood beside Naruto. This understanding finally brought him peace. Waking up, Sasuke admitted his defeat with a smile, acknowledged Naruto, and intended to end his life to atone. Naruto, however, told Sasuke not to think he could escape responsibility through death and asked him to live and help him. Sasuke questioned what would happen if he opposed Naruto again, to which Naruto replied he would stop him but was confident Sasuke wouldn't do that. When Sasuke asked why, Naruto reiterated that they were friends. Moved, Sasuke shed tears, and their blood formed a seal of reconciliation.\n\nSakura and Kakashi arrived at the Valley of the End to heal the severely injured duo. For the first time, Sasuke openly accepted his feelings, apologized to Sakura for his past actions, and joined Naruto in undoing the Infinite Tsukuyomi, freeing everyone trapped in the genjutsu.\n\nAfter recovering back in the village, Sasuke informed Kakashi and Sakura of his plan to embark on a journey to see the world and atone for what he missed due to his hatred. He declined Sakura's offer to accompany him but promised to return. Soon after leaving, Naruto caught up with Sasuke and returned his scratched Konoha forehead protector. Sasuke accepted it, pledged to uphold his ninja duties, and the two friends parted ways.\n",
    "Naruto Uzumaki": "Sasuke's only friend, and also his rival. Like Naruto, Sasuke was left alone after the Uchiha clan massacre. At first, Sasuke found Naruto, who was always causing trouble to get attention, to be annoying. However, seeing Naruto being scolded reminded Sasuke of his own family, and he felt a sense of comfort. After being placed in Team 7 together, despite Sasuke's aloofness, he and Naruto developed a friendship through their rivalry and began to acknowledge each other. However, as Naruto's power grew rapidly, Sasuke became uneasy, realizing Naruto was catching up to, and even surpassing, him. After encountering Itachi, Sasuke recognized his own weakness. Witnessing the power of Naruto's Rasengan made Sasuke anxious about being surpassed. After leaving Konoha to pursue power and revenge, Naruto was determined to bring Sasuke back. They fought in the Valley of the End, where Sasuke declared Naruto his best friend, feeling he needed to sever this bond to grow stronger. Sasuke ultimately won but did not kill Naruto.\n\nDuring Sasuke's absence, Naruto grew stronger, faced challenges such as the death of his mentor Jiraiya, and the destruction of Konoha by Pain, gradually earning the village's recognition and becoming a hero. After Sasuke allied with the Akatsuki and opposed the village, Sasuke's former comrades, including Team 7's teacher Kakashi and teammate Sakura, decided to consider Sasuke an enemy. However, Naruto remained steadfast in his resolve to bring Sasuke back. Learning the truth about the Uchiha massacre from Obito Uchiha, Naruto understood Sasuke's desire for revenge but still refused to give up on him. Itachi, upon confirming Naruto's resolve, implanted a crow carrying Shisui's Kotoamatsukami into Naruto to eventually let Sasuke protect Konoha. During the Fourth Great Ninja War, the reanimated Itachi entrusted Sasuke to Naruto.\n\nNaruto and Sasuke fought together during the war, and after sealing Kaguya Otsutsuki, they clashed again in the Valley of the End over Sasuke's plan to enact a revolution and become a global enemy. Sasuke aimed to sever his last bond with Naruto to achieve his goal. In the battle, Sasuke questioned Naruto's persistence in stopping him, asking why Naruto wouldn't let him cut this bond. Naruto responded, \"Because I'm your only friend.\" They fought until they both lost an arm and, in their immobile state, they talked. Naruto emphasized that Sasuke was his friend, which is why he was so determined. Seeing Sasuke burdened and lost caused Naruto pain, making it impossible to ignore. Sasuke admitted defeat, but Naruto argued there was never a winner or loser and prevented Sasuke from wanting to die, urging him to live and help him. After recovering, Sasuke left Konoha to travel, while Naruto continued working towards his dream of becoming Hokage, eventually achieving it and becoming the Seventh Hokage.\n",
    "Itachi Uchiha": "Itachi was a prodigious talent of the Uchiha clan, on par with Shisui Uchiha, and the two were close friends. Having experienced the Third Great Ninja War as a child, Itachi despised war and yearned for peace. After the Nine-Tails' attack on Konoha, the village's leadership suspected the Uchiha clan was behind the incident. Under Danzo Shimura's suggestion, they placed the Uchiha district under 24-hour surveillance. The growing dissatisfaction among the Uchiha led them to plan a coup. Trusting Danzo, Shisui was ambushed and had his right eye stolen by Danzo. To prevent his left eye from falling into Danzo's hands, Shisui entrusted it to Itachi, hoping he could stop the coup, and then committed suicide by jumping into a river.\n\nItachi reported the Uchiha's coup plans to the village leadership. Only the Third Hokage sought to resolve the matter peacefully through negotiations. Danzo approached Itachi, using the life of Itachi's younger brother, Sasuke, as leverage to compel Itachi to massacre his clan and keep it secret from Sasuke. Itachi was to gather intelligence as a rogue ninja to protect the village, prevent other nations from exploiting the situation, and to honor Shisui's will and protect his brother. In agony, Itachi accepted the mission. On the night of the coup, Itachi and Obito Uchiha slaughtered the Uchiha clan. Tearfully, Itachi bid farewell to his parents, who entrusted Sasuke to him. He set Sasuke on a path of vengeance against him before fleeing Konoha. Before leaving, he disguised himself as an Anbu member and warned Danzo not to harm Sasuke, threatening to leak village secrets to enemy nations. Following Obito's advice, Itachi joined the Akatsuki organization.\n\nAware of Naruto's determination to bring Sasuke back, Itachi placed a crow with Shisui's left eye inside Naruto. Itachi foresaw that if Sasuke killed him and later fell into darkness, seeking revenge on Konoha, he would fight Naruto. To gain power, Sasuke would likely transplant Itachi's Mangekyo Sharingan, at which point the crow would emerge and cast Kotoamatsukami to protect Konoha, forcibly altering Sasuke's will. During his battle with Sasuke, Itachi never intended to kill him and anticipated Sasuke's moves. Pretending to gouge Sasuke's eyes was a ruse to free him from Orochimaru's curse mark. Pushing Sasuke to his limits, Itachi triggered Orochimaru to emerge from Sasuke's body, which allowed Itachi to seal Orochimaru using the Totsuka Blade and burn his manifestation with Amaterasu. Smiling, he poked Sasuke's forehead and asked for his forgiveness one last time. During the Fourth Great Ninja War, Itachi was resurrected by Kabuto Yakushi using Edo Tensei. On the battlefield, he encountered Naruto, asked about Sasuke, and entrusted him to Naruto. Later, Itachi met Sasuke, revealed the truth about himself, and together, they defeated Kabuto, ending Edo Tensei. As Edo Tensei was lifted, Itachi told Sasuke, \"No matter what path you choose, I will always love you,\" and then his soul ascended.\n"
}