{
    "Stifler": "While a crude, shameless womanizer and an arrogant bully during his high school years, he has a hidden sensitive side and cares great deeply about his friends, even when those feelings aren't reciprocated. He has a younger brother and several cousins that appear prominently in the American Pie spin-off films.\n\nIn high school, Stifler was a member of the East Great Falls High lacrosse team, infamous for throwing out of control parties, and a friend his teammate Oz and Jim, despite his rivalry with their friend Paul Finch and mocking the three along with their friend Kevin for still being virgins. \n\nStifler also becomes obsessed with ruining one of the main characters (Finch) by exposing him as a geek to the girls of the school after Finch arranges for rumors (including one where he had defeated Stifler in a fight) about himself to be spread across the school in order to make him desirable as a prom date, resulting in Stifler's planned date dumping him in hopes of getting asked out by Finch. Stifler's revenge culminated in him putting Pentalax, a potent laxative, into Finch's drink of choice (mochaccino), giving him a case of explosive diarrhea that results in Finch being humiliated in front of a large group of female classmates. Finch however got revenge by making one of the rumors accurate, which was successfully seducing and making love to Stifler's mother.\n\nStifler is also on the wrong end of the first of three sight gags throughout the film's trilogy in this movie. After Kevin ejaculates into a full plastic cup of beer on a nightstand in a bedroom while trying to lose his virginity, the cup is replaced on the nightstand and Kevin and Vicky leave. Stifler comes in a short time later and as he's seducing his date, picks up the tainted beer and takes a large gulp, resulting in him making a mad rush to the toilet and vomit. Kevin asks him how the pale ale was, and Stifler shouts \"Fuck you!\" in disgust.\n\nStifler was also responsible for convincing Jim to set up a live Internet broadcast, when the sexy foreign exchange student Nadia arranges to get changed in his bedroom, only to ultimately begin masturbating to his collection of Porn magazines. The broadcast was witnessed by Finch, Kevin, Steve, his little brother Matt (who describes it as \"the coolest thing he has ever seen\"!) as well as the entire high school directory, after Jim addressed the email wrong\n",
    "Paul Finch": "Finch is a mochaccino-drinking sophisticate. Finch has a love-hate relationship with Steve Stifler. In American Pie, Finch, to better his chances of losing his virginity before he graduates high school, pays Jessica, a friend of Vicki's, to spread rumors about him, for example Finch beat up Stifler. However when Stifler hears of this, he becomes angry and decides to get revenge. Stifler secretly puts laxative into Finch's mochacchino and tricks him into using the girl's bathroom. When he comes out and sees a crowd of other students, among them is Stifler, Finch is embarrassed and is now dateless. On prom night, however, Finch not only succeeds in losing his virginity, he also gets revenge on Stifler by having sex with Stifler's attractive mother, much to Stifler's chagrin. ",
    "Jeanine": "Stifler's mother. Very little is known about her apart from the fact that she's divorced. She enjoys a hedonistic lifestyle, frequently shown drinking and showing off her wealth. Despite her reputation for sleeping with Finch, Stifler believes that his mother is a saint and she's the one person Stifler can't bully. "
}