{
    "Violet Weston": "Violet Weston is an elderly woman from Oklahoma with a fiery temper and an addiction to narcotics. After her husband's drowning, she becomes the matriarch of the family and the major reason that ultimately destroys the entire Weston family.\n\nViolet, battling oral cancer and a narcotics addiction, lives with her alcoholic husband, Beverly Weston, who hires Johnna, a young Cheyenne woman, as a live-in cook and caregiver for Violet.\n\nShortly after hiring Johnna, Beverly disappears. Violet calls her sister Mattie Fae and her daughters for support. Her family, including her daughters Barbara and Ivy, and later Karen, arrive at the house.\n\nFive days later, the sheriff informs them that Beverly has drowned. The family, already strained, gathers for his funeral.\n\nThe family sits down to dinner after the funeral; fueled by drugs, Violet insults and embarrasses each person at the table under the guise of \"truth-telling\", which results in Barbara pouncing on her in a fit of anger. Barbara has had enough of her mother's drug addiction, attacks her, knocks her to the ground, and confiscates her multitude of pills. Later, after Violet has had a chance to sober up, she has a tender moment with her daughters and shares a story that demonstrates how cruel her own mother was when she longed for a new pair of cowgirl boots when she was in her early teens. Instead of giving Violet the boots she wanted, her mother gave her a beautifully wrapped box on Christmas morning containing old, filthy men's work boots as a vicious prank.\n\nLater, Ivy tries to tell her mother about her relationship with Little Charles. Barbara tries to deflect the admission to protect Ivy from the truth. Violet tells Ivy that Charles is actually her brother, something Violet knew all along. Devastated, Ivy leaves and promises to never come back. In the last confrontation between Violet and Barbara, Violet admits she was contacted by Beverly from his motel the week after he had left home but did nothing to help him until after she removed money from the couple's joint safe deposit box. By that time, he had already killed himself. This revelation leads Barbara to depart, realizing that her mother is far beyond help.\n\nViolet is left alone with Johnna, seeking her comfort after experiencing an emotional breakdown.\n",
    "Barbara Weston-Fordham": "Barbara is Violet's oldest daughter, a control freak whose marriage has hit rock bottom, is in trouble, and her husband is cheating on her.",
    "Ivy Weston": "Ivy is Violet's second daughter. She is in love with her cousin, unaware they are half-siblings.",
    "Beverly Weston": "A writer and teacher whose first book of poems won him critical acclaim and a degree of fame in the 1960s, Beverly is grizzled and jaded at the start of the play. He is also a self-professed alcoholic who has decided to stop trying to quit drinking and instead devote himself to it fully. He hires Johnna Monevata to care for him and his wife Violet. He increasingly sank deeper into alcohol addiction, eventually escaping the family through suicide."
}