{
    "Willie Soke": "Willie T. Soke is a professional thief who works annually as a department store Santa Claus alongside his dwarf assistant Marcus Skidmore. They plan to rob shopping malls on Christmas Eve with Lois, Marcus' wife, serving as their getaway driver. Willie, a sex-addicted alcoholic, struggles with his job as Santa due to his crude behavior. At the Saguaro Square Mall in Phoenix, Willie meets Thurman Merman, a naive boy who believes Willie is Santa. Thurman lives with his senile grandmother and reveals his father is in jail. Willie manipulates Thurman into allowing him to rob their home safe.\nAs Willie's behavior escalates, he moves in with Thurman, angering Marcus. Mall security chief Gin Slagel discovers Willie's illegal residence and blackmails him. Tensions rise between Willie and Marcus, exacerbated by Willie's reckless actions and drunken behavior. Despite suicidal thoughts, Willie forms a bond with Thurman and defends him from bullies. Angered by Gin's threats, Marcus and Lois murder him, leading to a chaotic heist on Christmas Eve. Willie manages to steal the safe's contents and a coveted pink elephant for Thurman before Marcus attempts to kill him.\nPolice arrive unexpectedly, tipped off by Willie's letter confessing his crimes to Thurman. A firefight ensues, resulting in Willie getting shot but surviving. In the hospital, Willie reflects on his actions, thankful to Thurman for his inadvertent rescue and cleared of charges due to public embarrassment over shooting an unarmed Santa. Sue gains guardianship of Thurman as Willie looks forward to his recovery and return.\n",
    "Marcus Skidmore": "Marcus Skidmore is Willie T. Soke's dwarf assistant, and together they annually pose as department store Santa Claus and his elf to execute robbery schemes. Marcus's wife, Lois, serves as their getaway driver. Marcus takes his role seriously, striving to maintain secrecy and ensure the smooth execution of their criminal activities. However, he grows increasingly frustrated and disappointed with Willie's rude behavior, alcoholism, and irresponsibility. He clashes with Willie throughout the story, particularly when he becomes upset over Willie's exploitation of Thurman Merman. Marcus even contemplates killing Willie. Marcus and Lois demonstrate their cunning and ruthlessness when dealing with their blackmailer, security chief Gin Slagel.",
    "Thurman Merman": "Thurman Merman is a naive and easily deceived young boy who sincerely believes Willie T. Soke is the real Santa Claus. He lives with his senile grandmother and confides in Willie about his deceased mother and his father Roger, who he claims is \"exploring the mountains\" (though Roger is actually in jail for embezzlement). Thurman trusts and admires Willie greatly, sharing family secrets with him and allowing him to stay over. His innocence and kindness make him a frequent target for bullying by other children, especially a group of skateboarders who harass him. Throughout the story, Thurman demonstrates his kindness, sincerity, and boundless love for the Christmas spirit, ultimately becoming the catalyst for Willie to reassess his own life."
}